[
    {
        "id": "454626",
        "title": "Sonic the Hedgehog",
        "overview": "Powered with incredible speed, Sonic The Hedgehog embraces his new home on Earth. That is, until Sonic sparks the attention of super-uncool evil genius Dr. Robotnik. Now it’s super-villain vs. super-sonic in an all-out race across the globe to stop Robotnik from using Sonic’s unique power for world domination.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/aQvJ5WPzZgYVDrxLX4R6cLJCEaQ.jpg",
        "genres": "Action, Science Fiction, Comedy, Family",
        "unique_id": "sonicthehedgehog-454626",
        "release_date": "2020-02-12"
    },
    {
        "id": "529203",
        "title": "The Croods: A New Age",
        "overview": "Searching for a safer habitat, the prehistoric Crood family discovers an idyllic, walled-in paradise that meets all of its needs. Unfortunately, they must also learn to live with the Bettermans -- a family that's a couple of steps above the Croods on the evolutionary ladder. As tensions between the new neighbors start to rise, a new threat soon propels both clans on an epic adventure that forces them to embrace their differences, draw strength from one another, and survive together.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/tbVZ3Sq88dZaCANlUcewQuHQOaE.jpg",
        "genres": "Animation, Family, Adventure, Fantasy, Comedy",
        "unique_id": "thecroodsanewage-529203",
        "release_date": "2020-11-25"
    },
    {
        "id": "545609",
        "title": "Extraction",
        "overview": "A hardened gun-for-hire's latest mission becomes a soul-searching race to survive when he's sent into Bangladesh to rescue a drug lord's kidnapped son.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/nygOUcBKPHFTbxsYRFZVePqgPK6.jpg",
        "genres": "Action, Thriller",
        "unique_id": "extraction-545609",
        "release_date": "2020-04-23"
    },
    {
        "id": "627725",
        "title": "The Banker",
        "overview": "In the 1960s, two entrepreneurs hatch an ingenious business plan to fight for housing integration—and equal access to the American Dream. Nicholas Hoult and Nia Long co-star in this drama inspired by true events.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/biXzsw22U6vSd0XktmZwAOc4uik.jpg",
        "genres": "Drama",
        "unique_id": "thebanker-627725",
        "release_date": "2020-03-06"
    },
    {
        "id": "508442",
        "title": "Soul",
        "overview": "Joe Gardner is a middle school teacher with a love for jazz music. After a successful audition at the Half Note Club, he suddenly gets into an accident that separates his soul from his body and is transported to the You Seminar, a center in which souls develop and gain passions before being transported to a newborn child. Joe must enlist help from the other souls-in-training, like 22, a soul who has spent eons in the You Seminar, in order to get back to Earth.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/pEz5aROvfy5FBW1OTlrDO3VryWO.jpg",
        "genres": "Animation, Family, Comedy, Fantasy",
        "unique_id": "soul-508442",
        "release_date": "2020-12-25"
    },
    {
        "id": "524047",
        "title": "Greenland",
        "overview": "John Garrity, his estranged wife and their young son embark on a perilous journey to find sanctuary as a planet-killing comet hurtles toward Earth. Amid terrifying accounts of cities getting levelled, the Garritys experience the best and worst in humanity. As the countdown to the global apocalypse approaches zero, their incredible trek culminates in a desperate and last-minute flight to a possible safe haven.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/bNo2mcvSwIvnx8K6y1euAc1TLVq.jpg",
        "genres": "Action, Adventure, Science Fiction, Thriller",
        "unique_id": "greenland-524047",
        "release_date": "2020-07-29"
    },
    {
        "id": "635302",
        "title": "Demon Slayer -Kimetsu no Yaiba- The Movie: Mugen Train",
        "overview": "Tanjiro Kamado, joined with Inosuke Hashibira, a boy raised by boars who wears a boar's head, and Zenitsu Agatsuma, a scared boy who reveals his true power when he sleeps, boards the Infinity Train on a new mission with the Fire Hashira, Kyojuro Rengoku, to defeat a demon who has been tormenting the people and killing the demon slayers who oppose it!",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/h8Rb9gBr48ODIwYUttZNYeMWeUU.jpg",
        "genres": "Animation, Action, Fantasy, Thriller",
        "unique_id": "demonslayerkimetsunoyaibathemoviemugentrain-635302",
        "release_date": "2020-10-16"
    },
    {
        "id": "770156",
        "title": "Lucy Shimmers and the Prince of Peace",
        "overview": "Second chances start when a hardened criminal crosses paths with a precocious little girl who is helped by an angel to change hearts during the holiday season.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/yfnJ5qIYx7q33fY4jqv9Pu95RSg.jpg",
        "genres": "Drama, Family",
        "unique_id": "lucyshimmersandtheprinceofpeace-770156",
        "release_date": "2020-10-19"
    },
    {
        "id": "38700",
        "title": "Bad Boys for Life",
        "overview": "Marcus and Mike are forced to confront new threats, career changes, and midlife crises as they join the newly created elite team AMMO of the Miami police department to take down the ruthless Armando Armas, the vicious leader of a Miami drug cartel.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/y95lQLnuNKdPAzw9F9Ab8kJ80c3.jpg",
        "genres": "Thriller, Action, Crime",
        "unique_id": "badboysforlife-38700",
        "release_date": "2020-01-15"
    },
    {
        "id": "613504",
        "title": "After We Collided",
        "overview": "Tessa finds herself struggling with her complicated relationship with Hardin; she faces a dilemma that could change their lives forever.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/kiX7UYfOpYrMFSAGbI6j1pFkLzQ.jpg",
        "genres": "Romance, Drama",
        "unique_id": "afterwecollided-613504",
        "release_date": "2020-09-02"
    },
    {
        "id": "522627",
        "title": "The Gentlemen",
        "overview": "American expat Mickey Pearson has built a highly profitable marijuana empire in London. When word gets out that he’s looking to cash out of the business forever it triggers plots, schemes, bribery and blackmail in an attempt to steal his domain out from under him.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/jtrhTYB7xSrJxR1vusu99nvnZ1g.jpg",
        "genres": "Comedy, Crime",
        "unique_id": "thegentlemen-522627",
        "release_date": "2020-01-01"
    },
    {
        "id": "516486",
        "title": "Greyhound",
        "overview": "A first-time captain leads a convoy of allied ships carrying thousands of soldiers across the treacherous waters of the \"Black Pit\" to the front lines of WWII. With no air cover protection for 5 days, the captain and his convoy must battle the surrounding enemy Nazi U-boats in order to give the allies a chance to win the war.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/kjMbDciooTbJPofVXgAoFjfX8Of.jpg",
        "genres": "War, Action, Drama",
        "unique_id": "greyhound-516486",
        "release_date": "2020-07-09"
    },
    {
        "id": "577922",
        "title": "Tenet",
        "overview": "Armed with only one word - Tenet - and fighting for the survival of the entire world, the Protagonist journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/aCIFMriQh8rvhxpN1IWGgvH0Tlg.jpg",
        "genres": "Action, Thriller, Science Fiction",
        "unique_id": "tenet-577922",
        "release_date": "2020-08-22"
    },
    {
        "id": "514847",
        "title": "The Hunt",
        "overview": "Twelve strangers wake up in a clearing. They don't know where they are—or how they got there. In the shadow of a dark internet conspiracy theory, ruthless elitists gather at a remote location to hunt humans for sport. But their master plan is about to be derailed when one of the hunted turns the tables on her pursuers.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/wxPhn4ef1EAo5njxwBkAEVrlJJG.jpg",
        "genres": "Action, Thriller, Horror",
        "unique_id": "thehunt-514847",
        "release_date": "2020-03-11"
    },
    {
        "id": "514593",
        "title": "You Should Have Left",
        "overview": "In an effort to repair their relationship, a couple books a vacation in the countryside for themselves and their daughter. What starts as a perfect retreat begins to fall apart as one loses their grip on reality, and a sinister force tries to tear them apart.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/tpOwE6xsWnu4lKeKbKW0R3iClM.jpg",
        "genres": "Horror, Thriller",
        "unique_id": "youshouldhaveleft-514593",
        "release_date": "2020-06-18"
    },
    {
        "id": "464052",
        "title": "Wonder Woman 1984",
        "overview": "A botched store robbery places Wonder Woman in a global battle against a powerful and mysterious ancient force that puts her powers in jeopardy.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/8UlWHLMpgZm9bx6QYh0NFoq67TZ.jpg",
        "genres": "Action, Adventure, Fantasy",
        "unique_id": "wonderwoman1984-464052",
        "release_date": "2020-12-16"
    },
    {
        "id": "637649",
        "title": "Wrath of Man",
        "overview": "A cold and mysterious new security guard for a Los Angeles cash truck company surprises his co-workers when he unleashes precision skills during a heist. The crew is left wondering who he is and where he came from. Soon, the marksman's ultimate motive becomes clear as he takes dramatic and irrevocable steps to settle a score.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/M7SUK85sKjaStg4TKhlAVyGlz3.jpg",
        "genres": "Action, Crime, Thriller",
        "unique_id": "wrathofman-637649",
        "release_date": "2021-04-22"
    },
    {
        "id": "801335",
        "title": "Girl in the Basement",
        "overview": "Sara is a teen girl who is looking forward to her 18th birthday to move away from her controlling father Don. But before she could even blow out the candles, Don imprisons her in the basement of their home.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/qmddUxRwbsxHa7oEXm4PWh1KZe8.jpg",
        "genres": "Thriller, Crime, TV Movie",
        "unique_id": "girlinthebasement-801335",
        "release_date": "2021-02-27"
    },
    {
        "id": "588228",
        "title": "The Tomorrow War",
        "overview": "The world is stunned when a group of time travelers arrive from the year 2051 to deliver an urgent message: Thirty years in the future, mankind is losing a global war against a deadly alien species. The only hope for survival is for soldiers and civilians from the present to be transported to the future and join the fight. Among those recruited is high school teacher and family man Dan Forester. Determined to save the world for his young daughter, Dan teams up with a brilliant scientist and his estranged father in a desperate quest to rewrite the fate of the planet.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/34nDCQZwaEvsy4CFO5hkGRFDCVU.jpg",
        "genres": "Action, Science Fiction, Adventure",
        "unique_id": "thetomorrowwar-588228",
        "release_date": "2021-09-03"
    },
    {
        "id": "568124",
        "title": "Encanto",
        "overview": "The tale of an extraordinary family, the Madrigals, who live hidden in the mountains of Colombia, in a magical house, in a vibrant town, in a wondrous, charmed place called an Encanto. The magic of the Encanto has blessed every child in the family—every child except one, Mirabel. But when she discovers that the magic surrounding the Encanto is in danger, Mirabel decides that she, the only ordinary Madrigal, might just be her exceptional family's last hope.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/4j0PNHkMr5ax3IA8tjtxcmPU3QT.jpg",
        "genres": "Animation, Comedy, Family, Fantasy",
        "unique_id": "encanto-568124",
        "release_date": "2021-10-13"
    },
    {
        "id": "591273",
        "title": "Fear Street: 1994",
        "overview": "After a series of brutal slayings, a teen and her friends take on an evil force that's plagued their notorious town for centuries.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/9J9Wy39ZjrVmfk7yMkulpcI5sy0.jpg",
        "genres": "Horror, Mystery",
        "unique_id": "fearstreet1994-591273",
        "release_date": "2021-06-28"
    },
    {
        "id": "497698",
        "title": "Black Widow",
        "overview": "Natasha Romanoff, also known as Black Widow, confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises. Pursued by a force that will stop at nothing to bring her down, Natasha must deal with her history as a spy and the broken relationships left in her wake long before she became an Avenger.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/qAZ0pzat24kLdO3o8ejmbLxyOac.jpg",
        "genres": "Action, Adventure, Science Fiction",
        "unique_id": "blackwidow-497698",
        "release_date": "2021-07-07"
    },
    {
        "id": "438695",
        "title": "Sing 2",
        "overview": "Buster and his new cast now have their sights set on debuting a new show at the Crystal Tower Theater in glamorous Redshore City. But with no connections, he and his singers must sneak into the Crystal Entertainment offices, run by the ruthless wolf mogul Jimmy Crystal, where the gang pitches the ridiculous idea of casting the lion rock legend Clay Calloway in their show. Buster must embark on a quest to find the now-isolated Clay and persuade him to return to the stage.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/aWeKITRFbbwY8txG5uCj4rMCfSP.jpg",
        "genres": "Animation, Family, Music, Comedy",
        "unique_id": "sing2-438695",
        "release_date": "2021-12-01"
    },
    {
        "id": "566525",
        "title": "Shang-Chi and the Legend of the Ten Rings",
        "overview": "Shang-Chi must confront the past he thought he left behind when he is drawn into the web of the mysterious Ten Rings organization.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/d08HqqeBQSwN8i8MEvpsZ8Cb438.jpg",
        "genres": "Action, Adventure, Fantasy",
        "unique_id": "shangchiandthelegendofthetenrings-566525",
        "release_date": "2021-09-01"
    },
    {
        "id": "791373",
        "title": "Zack Snyder's Justice League",
        "overview": "Determined to ensure Superman's ultimate sacrifice was not in vain, Bruce Wayne aligns forces with Diana Prince with plans to recruit a team of metahumans to protect the world from an approaching threat of catastrophic proportions.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/tnAuB8q5vv7Ax9UAEje5Xi4BXik.jpg",
        "genres": "Action, Adventure, Fantasy",
        "unique_id": "zacksnydersjusticeleague-791373",
        "release_date": "2021-03-18"
    },
    {
        "id": "615457",
        "title": "Nobody",
        "overview": "Hutch Mansell, a suburban dad, overlooked husband, nothing neighbor — a \"nobody.\" When two thieves break into his home one night, Hutch's unknown long-simmering rage is ignited and propels him on a brutal path that will uncover dark secrets he fought to leave behind.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/oBgWY00bEFeZ9N25wWVyuQddbAo.jpg",
        "genres": "Action, Thriller",
        "unique_id": "nobody-615457",
        "release_date": "2021-03-18"
    },
    {
        "id": "508943",
        "title": "Luca",
        "overview": "Luca and his best friend Alberto experience an unforgettable summer on the Italian Riviera. But all the fun is threatened by a deeply-held secret: they are sea monsters from another world just below the water’s surface.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/9x4i9uKGXt8IiiIF5Ey0DIoY738.jpg",
        "genres": "Animation, Comedy, Fantasy, Adventure, Family",
        "unique_id": "luca-508943",
        "release_date": "2021-06-17"
    },
    {
        "id": "458220",
        "title": "Palmer",
        "overview": "After 12 years in prison, former high school football star Eddie Palmer returns home to put his life back together—and forms an unlikely bond with Sam, an outcast boy from a troubled home. But Eddie's past threatens to ruin his new life and family.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/xSDdRAjxKAGi8fUBLOqSrBhJmF0.jpg",
        "genres": "Drama",
        "unique_id": "palmer-458220",
        "release_date": "2021-01-28"
    },
    {
        "id": "634649",
        "title": "Spider-Man: No Way Home",
        "overview": "Peter Parker is unmasked and no longer able to separate his normal life from the high-stakes of being a super-hero. When he asks for help from Doctor Strange the stakes become even more dangerous, forcing him to discover what it truly means to be Spider-Man.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/1g0dhYtq4irTY1GPXvft6k4YLjm.jpg",
        "genres": "Action, Adventure, Science Fiction",
        "unique_id": "spidermannowayhome-634649",
        "release_date": "2021-12-15"
    },
    {
        "id": "337404",
        "title": "Cruella",
        "overview": "In 1970s London amidst the punk rock revolution, a young grifter named Estella is determined to make a name for herself with her designs. She befriends a pair of young thieves who appreciate her appetite for mischief, and together they are able to build a life for themselves on the London streets. One day, Estella’s flair for fashion catches the eye of the Baroness von Hellman, a fashion legend who is devastatingly chic and terrifyingly haute. But their relationship sets in motion a course of events and revelations that will cause Estella to embrace her wicked side and become the raucous, fashionable and revenge-bent Cruella.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/wToO8opxkGwKgSfJ1JK8tGvkG6U.jpg",
        "genres": "Comedy, Crime, Adventure",
        "unique_id": "cruella-337404",
        "release_date": "2021-05-26"
    },
    {
        "id": "438631",
        "title": "Dune",
        "overview": "Paul Atreides, a brilliant and gifted young man born into a great destiny beyond his understanding, must travel to the most dangerous planet in the universe to ensure the future of his family and his people. As malevolent forces explode into conflict over the planet's exclusive supply of the most precious resource in existence-a commodity capable of unlocking humanity's greatest potential-only those who can conquer their fear will survive.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/d5NXSklXo0qyIYkgV94XAgMIckC.jpg",
        "genres": "Science Fiction, Adventure",
        "unique_id": "dune-438631",
        "release_date": "2021-09-15"
    },
    {
        "id": "436969",
        "title": "The Suicide Squad",
        "overview": "Supervillains Harley Quinn, Bloodsport, Peacemaker and a collection of nutty cons at Belle Reve prison join the super-secret, super-shady Task Force X as they are dropped off at the remote, enemy-infused island of Corto Maltese.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/q61qEyssk2ku3okWICKArlAdhBn.jpg",
        "genres": "Action, Comedy, Adventure",
        "unique_id": "thesuicidesquad-436969",
        "release_date": "2021-07-28"
    },
    {
        "id": "423108",
        "title": "The Conjuring: The Devil Made Me Do It",
        "overview": "Paranormal investigators Ed and Lorraine Warren encounter what would become one of the most sensational cases from their files. The fight for the soul of a young boy takes them beyond anything they'd ever seen before, to mark the first time in U.S. history that a murder suspect would claim demonic possession as a defense.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/xbSuFiJbbBWCkyCCKIMfuDCA4yV.jpg",
        "genres": "Horror, Mystery, Thriller",
        "unique_id": "theconjuringthedevilmademedoit-423108",
        "release_date": "2021-05-25"
    },
    {
        "id": "846433",
        "title": "The Enforcer",
        "overview": "A noir thriller set in Miami, the film follows an enforcer who discovers his femme fatale boss has branched out into cyber sex trafficking, putting a young runaway he’s befriended at risk. He sacrifices everything to save the young girl from the deadly organization he’s spent his life building.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/72V1r1G8S87ELagVxjqAUdChMCt.jpg",
        "genres": "Action, Crime, Drama",
        "unique_id": "theenforcer-846433",
        "release_date": "2022-09-22"
    },
    {
        "id": "1017129",
        "title": "Detective Chirp & the Golden Beehive",
        "overview": "Residents of Honey Valley are getting ready for their favorite holiday - City Day, when all citizens have the opportunity to admire a unique artifact - the Golden Hive. According to legend, it was found by the founders of Honey Valley, and legend has it that thousands of misfortunes will fall upon the town if the Hive disappears. On the eve of the holiday, the Beehive is kidnapped. The squirrel Chink, Sophie's owl detective's assistant, is blamed for this. Chink and his friends have to unravel the case, find the real crook and return not only the Golden Hive, but also peace to the Valley.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/oxCPceQ4exEuxU3vfRl8doWyqj8.jpg",
        "genres": "Animation, Comedy, Mystery, Adventure, Family",
        "unique_id": "detectivechirpthegoldenbeehive-1017129",
        "release_date": "2022-11-17"
    },
    {
        "id": "315162",
        "title": "Puss in Boots: The Last Wish",
        "overview": "Puss in Boots discovers that his passion for adventure has taken its toll: He has burned through eight of his nine lives, leaving him with only one life left. Puss sets out on an epic journey to find the mythical Last Wish and restore his nine lives.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/aV1KGO9X3S4kzqEptVDAvGjccql.jpg",
        "genres": "Animation, Adventure, Fantasy, Comedy, Family",
        "unique_id": "pussinbootsthelastwish-315162",
        "release_date": "2022-12-07"
    },
    {
        "id": "414906",
        "title": "The Batman",
        "overview": "In his second year of fighting crime, Batman uncovers corruption in Gotham City that connects to his own family while facing a serial killer known as the Riddler.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/74xTEgt7R36Fpooo50r9T25onhq.jpg",
        "genres": "Crime, Mystery, Thriller",
        "unique_id": "thebatman-414906",
        "release_date": "2022-03-01"
    },
    {
        "id": "1018247",
        "title": "MK Ultra",
        "overview": "Set during the true and unconscionable Central Intelligence Agency MK ULTRA drug experimentations in the early 1960s. The journey of Ford Strauss, a brilliant psychiatrist, whose moral and scientific boundaries are pushed to the limit as he is recruited to run a subsect of the program in a rural Mississippi Mental Hospital.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/x3G3CCvLYy4EoLuhuUB9YlReFIN.jpg",
        "genres": "Thriller",
        "unique_id": "mkultra-1018247",
        "release_date": "2022-10-07"
    },
    {
        "id": "361743",
        "title": "Top Gun: Maverick",
        "overview": "After more than thirty years of service as one of the Navy’s top aviators, and dodging the advancement in rank that would ground him, Pete “Maverick” Mitchell finds himself training a detachment of TOP GUN graduates for a specialized mission the likes of which no living pilot has ever seen.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/62HCnUTziyWcpDaBO2i1DX17ljH.jpg",
        "genres": "Action, Drama",
        "unique_id": "topgunmaverick-361743",
        "release_date": "2022-05-21"
    },
    {
        "id": "987573",
        "title": "Believers",
        "overview": "On a small island somewhere near Japan, three cult members have devoted themselves to the \"Deserted Island Program\". Calling each other by rank, these people-two men and one women-have been chosen by their superiors to throw off the corrupt influence of modern society and \"purify\" themselves. But as time passes two of the members begin to give into human desire.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/sw1sFRVaUCHD0CVTXtnoEFFYyr6.jpg",
        "genres": "Drama",
        "unique_id": "believers-987573",
        "release_date": "2022-07-08"
    },
    {
        "id": "985939",
        "title": "Fall",
        "overview": "For best friends Becky and Hunter, life is all about conquering fears and pushing limits. But after they climb 2,000 feet to the top of a remote, abandoned radio tower, they find themselves stranded with no way down. Now Becky and Hunter’s expert climbing skills will be put to the ultimate test as they desperately fight to survive the elements, a lack of supplies, and vertigo-inducing heights",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/spCAxD99U1A6jsiePFoqdEcY0dG.jpg",
        "genres": "Thriller",
        "unique_id": "fall-985939",
        "release_date": "2022-08-11"
    },
    {
        "id": "718930",
        "title": "Bullet Train",
        "overview": "Unlucky assassin Ladybug is determined to do his job peacefully after one too many gigs gone off the rails. Fate, however, may have other plans, as Ladybug's latest mission puts him on a collision course with lethal adversaries from around the globe—all with connected, yet conflicting, objectives—on the world's fastest train.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/zTgMFlHG5D1EqdQDhfOTAsyzGoX.jpg",
        "genres": "Action, Comedy, Thriller",
        "unique_id": "bullettrain-718930",
        "release_date": "2022-08-03"
    },
    {
        "id": "76600",
        "title": "Avatar: The Way of Water",
        "overview": "Set more than a decade after the events of the first film, learn the story of the Sully family (Jake, Neytiri, and their kids), the trouble that follows them, the lengths they go to keep each other safe, the battles they fight to stay alive, and the tragedies they endure.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/t6HIqrRAclMCA60NsSmeqe9RmNV.jpg",
        "genres": "Science Fiction, Adventure, Action",
        "unique_id": "avatarthewayofwater-76600",
        "release_date": "2022-12-14"
    },
    {
        "id": "675353",
        "title": "Sonic the Hedgehog 2",
        "overview": "After settling in Green Hills, Sonic is eager to prove he has what it takes to be a true hero. His test comes when Dr. Robotnik returns, this time with a new partner, Knuckles, in search for an emerald that has the power to destroy civilizations. Sonic teams up with his own sidekick, Tails, and together they embark on a globe-trotting journey to find the emerald before it falls into the wrong hands.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/6DrHO1jr3qVrViUO6s6kFiAGM7.jpg",
        "genres": "Action, Adventure, Family, Comedy",
        "unique_id": "sonicthehedgehog2-675353",
        "release_date": "2022-03-30"
    },
    {
        "id": "507086",
        "title": "Jurassic World Dominion",
        "overview": "Four years after Isla Nublar was destroyed, dinosaurs now live—and hunt—alongside humans all over the world. This fragile balance will reshape the future and determine, once and for all, whether human beings are to remain the apex predators on a planet they now share with history's most fearsome creatures.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/jbAvCACjLf1ZG0unB2tdmx5HAf1.jpg",
        "genres": "Adventure, Action, Science Fiction",
        "unique_id": "jurassicworlddominion-507086",
        "release_date": "2022-06-01"
    },
    {
        "id": "453395",
        "title": "Doctor Strange in the Multiverse of Madness",
        "overview": "Doctor Strange, with the help of mystical allies both old and new, traverses the mind-bending and dangerous alternate realities of the Multiverse to confront a mysterious new adversary.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/ddJcSKbcp4rKZTmuyWaMhuwcfMz.jpg",
        "genres": "Fantasy, Action, Adventure",
        "unique_id": "doctorstrangeinthemultiverseofmadness-453395",
        "release_date": "2022-05-04"
    },
    {
        "id": "505642",
        "title": "Black Panther: Wakanda Forever",
        "overview": "Queen Ramonda, Shuri, M’Baku, Okoye and the Dora Milaje fight to protect their nation from intervening world powers in the wake of King T’Challa’s death.  As the Wakandans strive to embrace their next chapter, the heroes must band together with the help of War Dog Nakia and Everett Ross and forge a new path for the kingdom of Wakanda.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/sv1xJUazXeYqALzczSZ3O6nkH75.jpg",
        "genres": "Action, Adventure, Science Fiction",
        "unique_id": "blackpantherwakandaforever-505642",
        "release_date": "2022-11-09"
    }
]