[
    {
        "id": "454626",
        "title": "Sonic the Hedgehog",
        "overview": "Powered with incredible speed, Sonic The Hedgehog embraces his new home on Earth. That is, until Sonic sparks the attention of super-uncool evil genius Dr. Robotnik. Now it’s super-villain vs. super-sonic in an all-out race across the globe to stop Robotnik from using Sonic’s unique power for world domination.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/aQvJ5WPzZgYVDrxLX4R6cLJCEaQ.jpg",
        "genres": "Action, Science Fiction, Comedy, Family",
        "unique_id": "sonicthehedgehog-454626",
        "release_date": "2020-02-12"
    },
    {
        "id": "529203",
        "title": "The Croods: A New Age",
        "overview": "Searching for a safer habitat, the prehistoric Crood family discovers an idyllic, walled-in paradise that meets all of its needs. Unfortunately, they must also learn to live with the Bettermans -- a family that's a couple of steps above the Croods on the evolutionary ladder. As tensions between the new neighbors start to rise, a new threat soon propels both clans on an epic adventure that forces them to embrace their differences, draw strength from one another, and survive together.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/tbVZ3Sq88dZaCANlUcewQuHQOaE.jpg",
        "genres": "Animation, Family, Adventure, Fantasy, Comedy",
        "unique_id": "thecroodsanewage-529203",
        "release_date": "2020-11-25"
    },
    {
        "id": "545609",
        "title": "Extraction",
        "overview": "A hardened gun-for-hire's latest mission becomes a soul-searching race to survive when he's sent into Bangladesh to rescue a drug lord's kidnapped son.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/nygOUcBKPHFTbxsYRFZVePqgPK6.jpg",
        "genres": "Action, Thriller",
        "unique_id": "extraction-545609",
        "release_date": "2020-04-23"
    },
    {
        "id": "627725",
        "title": "The Banker",
        "overview": "In the 1960s, two entrepreneurs hatch an ingenious business plan to fight for housing integration—and equal access to the American Dream. Nicholas Hoult and Nia Long co-star in this drama inspired by true events.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/biXzsw22U6vSd0XktmZwAOc4uik.jpg",
        "genres": "Drama",
        "unique_id": "thebanker-627725",
        "release_date": "2020-03-06"
    },
    {
        "id": "508442",
        "title": "Soul",
        "overview": "Joe Gardner is a middle school teacher with a love for jazz music. After a successful audition at the Half Note Club, he suddenly gets into an accident that separates his soul from his body and is transported to the You Seminar, a center in which souls develop and gain passions before being transported to a newborn child. Joe must enlist help from the other souls-in-training, like 22, a soul who has spent eons in the You Seminar, in order to get back to Earth.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/pEz5aROvfy5FBW1OTlrDO3VryWO.jpg",
        "genres": "Animation, Family, Comedy, Fantasy",
        "unique_id": "soul-508442",
        "release_date": "2020-12-25"
    },
    {
        "id": "524047",
        "title": "Greenland",
        "overview": "John Garrity, his estranged wife and their young son embark on a perilous journey to find sanctuary as a planet-killing comet hurtles toward Earth. Amid terrifying accounts of cities getting levelled, the Garritys experience the best and worst in humanity. As the countdown to the global apocalypse approaches zero, their incredible trek culminates in a desperate and last-minute flight to a possible safe haven.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/bNo2mcvSwIvnx8K6y1euAc1TLVq.jpg",
        "genres": "Action, Adventure, Science Fiction, Thriller",
        "unique_id": "greenland-524047",
        "release_date": "2020-07-29"
    },
    {
        "id": "635302",
        "title": "Demon Slayer -Kimetsu no Yaiba- The Movie: Mugen Train",
        "overview": "Tanjiro Kamado, joined with Inosuke Hashibira, a boy raised by boars who wears a boar's head, and Zenitsu Agatsuma, a scared boy who reveals his true power when he sleeps, boards the Infinity Train on a new mission with the Fire Hashira, Kyojuro Rengoku, to defeat a demon who has been tormenting the people and killing the demon slayers who oppose it!",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/h8Rb9gBr48ODIwYUttZNYeMWeUU.jpg",
        "genres": "Animation, Action, Fantasy, Thriller",
        "unique_id": "demonslayerkimetsunoyaibathemoviemugentrain-635302",
        "release_date": "2020-10-16"
    },
    {
        "id": "770156",
        "title": "Lucy Shimmers and the Prince of Peace",
        "overview": "Second chances start when a hardened criminal crosses paths with a precocious little girl who is helped by an angel to change hearts during the holiday season.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/yfnJ5qIYx7q33fY4jqv9Pu95RSg.jpg",
        "genres": "Drama, Family",
        "unique_id": "lucyshimmersandtheprinceofpeace-770156",
        "release_date": "2020-10-19"
    },
    {
        "id": "38700",
        "title": "Bad Boys for Life",
        "overview": "Marcus and Mike are forced to confront new threats, career changes, and midlife crises as they join the newly created elite team AMMO of the Miami police department to take down the ruthless Armando Armas, the vicious leader of a Miami drug cartel.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/y95lQLnuNKdPAzw9F9Ab8kJ80c3.jpg",
        "genres": "Thriller, Action, Crime",
        "unique_id": "badboysforlife-38700",
        "release_date": "2020-01-15"
    },
    {
        "id": "613504",
        "title": "After We Collided",
        "overview": "Tessa finds herself struggling with her complicated relationship with Hardin; she faces a dilemma that could change their lives forever.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/kiX7UYfOpYrMFSAGbI6j1pFkLzQ.jpg",
        "genres": "Romance, Drama",
        "unique_id": "afterwecollided-613504",
        "release_date": "2020-09-02"
    },
    {
        "id": "522627",
        "title": "The Gentlemen",
        "overview": "American expat Mickey Pearson has built a highly profitable marijuana empire in London. When word gets out that he’s looking to cash out of the business forever it triggers plots, schemes, bribery and blackmail in an attempt to steal his domain out from under him.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/jtrhTYB7xSrJxR1vusu99nvnZ1g.jpg",
        "genres": "Comedy, Crime",
        "unique_id": "thegentlemen-522627",
        "release_date": "2020-01-01"
    },
    {
        "id": "516486",
        "title": "Greyhound",
        "overview": "A first-time captain leads a convoy of allied ships carrying thousands of soldiers across the treacherous waters of the \"Black Pit\" to the front lines of WWII. With no air cover protection for 5 days, the captain and his convoy must battle the surrounding enemy Nazi U-boats in order to give the allies a chance to win the war.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/kjMbDciooTbJPofVXgAoFjfX8Of.jpg",
        "genres": "War, Action, Drama",
        "unique_id": "greyhound-516486",
        "release_date": "2020-07-09"
    },
    {
        "id": "577922",
        "title": "Tenet",
        "overview": "Armed with only one word - Tenet - and fighting for the survival of the entire world, the Protagonist journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/aCIFMriQh8rvhxpN1IWGgvH0Tlg.jpg",
        "genres": "Action, Thriller, Science Fiction",
        "unique_id": "tenet-577922",
        "release_date": "2020-08-22"
    },
    {
        "id": "514847",
        "title": "The Hunt",
        "overview": "Twelve strangers wake up in a clearing. They don't know where they are—or how they got there. In the shadow of a dark internet conspiracy theory, ruthless elitists gather at a remote location to hunt humans for sport. But their master plan is about to be derailed when one of the hunted turns the tables on her pursuers.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/wxPhn4ef1EAo5njxwBkAEVrlJJG.jpg",
        "genres": "Action, Thriller, Horror",
        "unique_id": "thehunt-514847",
        "release_date": "2020-03-11"
    },
    {
        "id": "514593",
        "title": "You Should Have Left",
        "overview": "In an effort to repair their relationship, a couple books a vacation in the countryside for themselves and their daughter. What starts as a perfect retreat begins to fall apart as one loses their grip on reality, and a sinister force tries to tear them apart.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/tpOwE6xsWnu4lKeKbKW0R3iClM.jpg",
        "genres": "Horror, Thriller",
        "unique_id": "youshouldhaveleft-514593",
        "release_date": "2020-06-18"
    },
    {
        "id": "464052",
        "title": "Wonder Woman 1984",
        "overview": "A botched store robbery places Wonder Woman in a global battle against a powerful and mysterious ancient force that puts her powers in jeopardy.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/8UlWHLMpgZm9bx6QYh0NFoq67TZ.jpg",
        "genres": "Action, Adventure, Fantasy",
        "unique_id": "wonderwoman1984-464052",
        "release_date": "2020-12-16"
    }
]