[
    {
        "id": "454626",
        "title": "Sonic the Hedgehog",
        "overview": "Powered with incredible speed, Sonic The Hedgehog embraces his new home on Earth. That is, until Sonic sparks the attention of super-uncool evil genius Dr. Robotnik. Now it’s super-villain vs. super-sonic in an all-out race across the globe to stop Robotnik from using Sonic’s unique power for world domination.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/aQvJ5WPzZgYVDrxLX4R6cLJCEaQ.jpg",
        "genres": "Action, Science Fiction, Comedy, Family",
        "unique_id": "sonicthehedgehog-454626",
        "release_date": "2020-02-12"
    },
    {
        "id": "529203",
        "title": "The Croods: A New Age",
        "overview": "Searching for a safer habitat, the prehistoric Crood family discovers an idyllic, walled-in paradise that meets all of its needs. Unfortunately, they must also learn to live with the Bettermans -- a family that's a couple of steps above the Croods on the evolutionary ladder. As tensions between the new neighbors start to rise, a new threat soon propels both clans on an epic adventure that forces them to embrace their differences, draw strength from one another, and survive together.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/tbVZ3Sq88dZaCANlUcewQuHQOaE.jpg",
        "genres": "Animation, Family, Adventure, Fantasy, Comedy",
        "unique_id": "thecroodsanewage-529203",
        "release_date": "2020-11-25"
    },
    {
        "id": "545609",
        "title": "Extraction",
        "overview": "A hardened gun-for-hire's latest mission becomes a soul-searching race to survive when he's sent into Bangladesh to rescue a drug lord's kidnapped son.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/nygOUcBKPHFTbxsYRFZVePqgPK6.jpg",
        "genres": "Action, Thriller",
        "unique_id": "extraction-545609",
        "release_date": "2020-04-23"
    },
    {
        "id": "627725",
        "title": "The Banker",
        "overview": "In the 1960s, two entrepreneurs hatch an ingenious business plan to fight for housing integration—and equal access to the American Dream. Nicholas Hoult and Nia Long co-star in this drama inspired by true events.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/biXzsw22U6vSd0XktmZwAOc4uik.jpg",
        "genres": "Drama",
        "unique_id": "thebanker-627725",
        "release_date": "2020-03-06"
    },
    {
        "id": "508442",
        "title": "Soul",
        "overview": "Joe Gardner is a middle school teacher with a love for jazz music. After a successful audition at the Half Note Club, he suddenly gets into an accident that separates his soul from his body and is transported to the You Seminar, a center in which souls develop and gain passions before being transported to a newborn child. Joe must enlist help from the other souls-in-training, like 22, a soul who has spent eons in the You Seminar, in order to get back to Earth.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/pEz5aROvfy5FBW1OTlrDO3VryWO.jpg",
        "genres": "Animation, Family, Comedy, Fantasy",
        "unique_id": "soul-508442",
        "release_date": "2020-12-25"
    },
    {
        "id": "524047",
        "title": "Greenland",
        "overview": "John Garrity, his estranged wife and their young son embark on a perilous journey to find sanctuary as a planet-killing comet hurtles toward Earth. Amid terrifying accounts of cities getting levelled, the Garritys experience the best and worst in humanity. As the countdown to the global apocalypse approaches zero, their incredible trek culminates in a desperate and last-minute flight to a possible safe haven.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/bNo2mcvSwIvnx8K6y1euAc1TLVq.jpg",
        "genres": "Action, Adventure, Science Fiction, Thriller",
        "unique_id": "greenland-524047",
        "release_date": "2020-07-29"
    },
    {
        "id": "635302",
        "title": "Demon Slayer -Kimetsu no Yaiba- The Movie: Mugen Train",
        "overview": "Tanjiro Kamado, joined with Inosuke Hashibira, a boy raised by boars who wears a boar's head, and Zenitsu Agatsuma, a scared boy who reveals his true power when he sleeps, boards the Infinity Train on a new mission with the Fire Hashira, Kyojuro Rengoku, to defeat a demon who has been tormenting the people and killing the demon slayers who oppose it!",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/h8Rb9gBr48ODIwYUttZNYeMWeUU.jpg",
        "genres": "Animation, Action, Fantasy, Thriller",
        "unique_id": "demonslayerkimetsunoyaibathemoviemugentrain-635302",
        "release_date": "2020-10-16"
    },
    {
        "id": "770156",
        "title": "Lucy Shimmers and the Prince of Peace",
        "overview": "Second chances start when a hardened criminal crosses paths with a precocious little girl who is helped by an angel to change hearts during the holiday season.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/yfnJ5qIYx7q33fY4jqv9Pu95RSg.jpg",
        "genres": "Drama, Family",
        "unique_id": "lucyshimmersandtheprinceofpeace-770156",
        "release_date": "2020-10-19"
    },
    {
        "id": "38700",
        "title": "Bad Boys for Life",
        "overview": "Marcus and Mike are forced to confront new threats, career changes, and midlife crises as they join the newly created elite team AMMO of the Miami police department to take down the ruthless Armando Armas, the vicious leader of a Miami drug cartel.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/y95lQLnuNKdPAzw9F9Ab8kJ80c3.jpg",
        "genres": "Thriller, Action, Crime",
        "unique_id": "badboysforlife-38700",
        "release_date": "2020-01-15"
    },
    {
        "id": "613504",
        "title": "After We Collided",
        "overview": "Tessa finds herself struggling with her complicated relationship with Hardin; she faces a dilemma that could change their lives forever.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/kiX7UYfOpYrMFSAGbI6j1pFkLzQ.jpg",
        "genres": "Romance, Drama",
        "unique_id": "afterwecollided-613504",
        "release_date": "2020-09-02"
    },
    {
        "id": "522627",
        "title": "The Gentlemen",
        "overview": "American expat Mickey Pearson has built a highly profitable marijuana empire in London. When word gets out that he’s looking to cash out of the business forever it triggers plots, schemes, bribery and blackmail in an attempt to steal his domain out from under him.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/jtrhTYB7xSrJxR1vusu99nvnZ1g.jpg",
        "genres": "Comedy, Crime",
        "unique_id": "thegentlemen-522627",
        "release_date": "2020-01-01"
    },
    {
        "id": "516486",
        "title": "Greyhound",
        "overview": "A first-time captain leads a convoy of allied ships carrying thousands of soldiers across the treacherous waters of the \"Black Pit\" to the front lines of WWII. With no air cover protection for 5 days, the captain and his convoy must battle the surrounding enemy Nazi U-boats in order to give the allies a chance to win the war.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/kjMbDciooTbJPofVXgAoFjfX8Of.jpg",
        "genres": "War, Action, Drama",
        "unique_id": "greyhound-516486",
        "release_date": "2020-07-09"
    },
    {
        "id": "577922",
        "title": "Tenet",
        "overview": "Armed with only one word - Tenet - and fighting for the survival of the entire world, the Protagonist journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/aCIFMriQh8rvhxpN1IWGgvH0Tlg.jpg",
        "genres": "Action, Thriller, Science Fiction",
        "unique_id": "tenet-577922",
        "release_date": "2020-08-22"
    },
    {
        "id": "514847",
        "title": "The Hunt",
        "overview": "Twelve strangers wake up in a clearing. They don't know where they are—or how they got there. In the shadow of a dark internet conspiracy theory, ruthless elitists gather at a remote location to hunt humans for sport. But their master plan is about to be derailed when one of the hunted turns the tables on her pursuers.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/wxPhn4ef1EAo5njxwBkAEVrlJJG.jpg",
        "genres": "Action, Thriller, Horror",
        "unique_id": "thehunt-514847",
        "release_date": "2020-03-11"
    },
    {
        "id": "464052",
        "title": "Wonder Woman 1984",
        "overview": "A botched store robbery places Wonder Woman in a global battle against a powerful and mysterious ancient force that puts her powers in jeopardy.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/8UlWHLMpgZm9bx6QYh0NFoq67TZ.jpg",
        "genres": "Action, Adventure, Fantasy",
        "unique_id": "wonderwoman1984-464052",
        "release_date": "2020-12-16"
    },
    {
        "id": "637649",
        "title": "Wrath of Man",
        "overview": "A cold and mysterious new security guard for a Los Angeles cash truck company surprises his co-workers when he unleashes precision skills during a heist. The crew is left wondering who he is and where he came from. Soon, the marksman's ultimate motive becomes clear as he takes dramatic and irrevocable steps to settle a score.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/M7SUK85sKjaStg4TKhlAVyGlz3.jpg",
        "genres": "Action, Crime, Thriller",
        "unique_id": "wrathofman-637649",
        "release_date": "2021-04-22"
    },
    {
        "id": "801335",
        "title": "Girl in the Basement",
        "overview": "Sara is a teen girl who is looking forward to her 18th birthday to move away from her controlling father Don. But before she could even blow out the candles, Don imprisons her in the basement of their home.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/qmddUxRwbsxHa7oEXm4PWh1KZe8.jpg",
        "genres": "Thriller, Crime, TV Movie",
        "unique_id": "girlinthebasement-801335",
        "release_date": "2021-02-27"
    },
    {
        "id": "588228",
        "title": "The Tomorrow War",
        "overview": "The world is stunned when a group of time travelers arrive from the year 2051 to deliver an urgent message: Thirty years in the future, mankind is losing a global war against a deadly alien species. The only hope for survival is for soldiers and civilians from the present to be transported to the future and join the fight. Among those recruited is high school teacher and family man Dan Forester. Determined to save the world for his young daughter, Dan teams up with a brilliant scientist and his estranged father in a desperate quest to rewrite the fate of the planet.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/34nDCQZwaEvsy4CFO5hkGRFDCVU.jpg",
        "genres": "Action, Science Fiction, Adventure",
        "unique_id": "thetomorrowwar-588228",
        "release_date": "2021-09-03"
    },
    {
        "id": "568124",
        "title": "Encanto",
        "overview": "The tale of an extraordinary family, the Madrigals, who live hidden in the mountains of Colombia, in a magical house, in a vibrant town, in a wondrous, charmed place called an Encanto. The magic of the Encanto has blessed every child in the family—every child except one, Mirabel. But when she discovers that the magic surrounding the Encanto is in danger, Mirabel decides that she, the only ordinary Madrigal, might just be her exceptional family's last hope.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/4j0PNHkMr5ax3IA8tjtxcmPU3QT.jpg",
        "genres": "Animation, Comedy, Family, Fantasy",
        "unique_id": "encanto-568124",
        "release_date": "2021-10-13"
    },
    {
        "id": "591273",
        "title": "Fear Street: 1994",
        "overview": "After a series of brutal slayings, a teen and her friends take on an evil force that's plagued their notorious town for centuries.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/9J9Wy39ZjrVmfk7yMkulpcI5sy0.jpg",
        "genres": "Horror, Mystery",
        "unique_id": "fearstreet1994-591273",
        "release_date": "2021-06-28"
    },
    {
        "id": "497698",
        "title": "Black Widow",
        "overview": "Natasha Romanoff, also known as Black Widow, confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises. Pursued by a force that will stop at nothing to bring her down, Natasha must deal with her history as a spy and the broken relationships left in her wake long before she became an Avenger.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/qAZ0pzat24kLdO3o8ejmbLxyOac.jpg",
        "genres": "Action, Adventure, Science Fiction",
        "unique_id": "blackwidow-497698",
        "release_date": "2021-07-07"
    },
    {
        "id": "438695",
        "title": "Sing 2",
        "overview": "Buster and his new cast now have their sights set on debuting a new show at the Crystal Tower Theater in glamorous Redshore City. But with no connections, he and his singers must sneak into the Crystal Entertainment offices, run by the ruthless wolf mogul Jimmy Crystal, where the gang pitches the ridiculous idea of casting the lion rock legend Clay Calloway in their show. Buster must embark on a quest to find the now-isolated Clay and persuade him to return to the stage.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/aWeKITRFbbwY8txG5uCj4rMCfSP.jpg",
        "genres": "Animation, Family, Music, Comedy",
        "unique_id": "sing2-438695",
        "release_date": "2021-12-01"
    },
    {
        "id": "566525",
        "title": "Shang-Chi and the Legend of the Ten Rings",
        "overview": "Shang-Chi must confront the past he thought he left behind when he is drawn into the web of the mysterious Ten Rings organization.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/d08HqqeBQSwN8i8MEvpsZ8Cb438.jpg",
        "genres": "Action, Adventure, Fantasy",
        "unique_id": "shangchiandthelegendofthetenrings-566525",
        "release_date": "2021-09-01"
    },
    {
        "id": "791373",
        "title": "Zack Snyder's Justice League",
        "overview": "Determined to ensure Superman's ultimate sacrifice was not in vain, Bruce Wayne aligns forces with Diana Prince with plans to recruit a team of metahumans to protect the world from an approaching threat of catastrophic proportions.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/tnAuB8q5vv7Ax9UAEje5Xi4BXik.jpg",
        "genres": "Action, Adventure, Fantasy",
        "unique_id": "zacksnydersjusticeleague-791373",
        "release_date": "2021-03-18"
    },
    {
        "id": "615457",
        "title": "Nobody",
        "overview": "Hutch Mansell, a suburban dad, overlooked husband, nothing neighbor — a \"nobody.\" When two thieves break into his home one night, Hutch's unknown long-simmering rage is ignited and propels him on a brutal path that will uncover dark secrets he fought to leave behind.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/oBgWY00bEFeZ9N25wWVyuQddbAo.jpg",
        "genres": "Action, Thriller",
        "unique_id": "nobody-615457",
        "release_date": "2021-03-18"
    },
    {
        "id": "508943",
        "title": "Luca",
        "overview": "Luca and his best friend Alberto experience an unforgettable summer on the Italian Riviera. But all the fun is threatened by a deeply-held secret: they are sea monsters from another world just below the water’s surface.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/9x4i9uKGXt8IiiIF5Ey0DIoY738.jpg",
        "genres": "Animation, Comedy, Fantasy, Adventure, Family",
        "unique_id": "luca-508943",
        "release_date": "2021-06-17"
    },
    {
        "id": "458220",
        "title": "Palmer",
        "overview": "After 12 years in prison, former high school football star Eddie Palmer returns home to put his life back together—and forms an unlikely bond with Sam, an outcast boy from a troubled home. But Eddie's past threatens to ruin his new life and family.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/xSDdRAjxKAGi8fUBLOqSrBhJmF0.jpg",
        "genres": "Drama",
        "unique_id": "palmer-458220",
        "release_date": "2021-01-28"
    },
    {
        "id": "634649",
        "title": "Spider-Man: No Way Home",
        "overview": "Peter Parker is unmasked and no longer able to separate his normal life from the high-stakes of being a super-hero. When he asks for help from Doctor Strange the stakes become even more dangerous, forcing him to discover what it truly means to be Spider-Man.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/1g0dhYtq4irTY1GPXvft6k4YLjm.jpg",
        "genres": "Action, Adventure, Science Fiction",
        "unique_id": "spidermannowayhome-634649",
        "release_date": "2021-12-15"
    },
    {
        "id": "337404",
        "title": "Cruella",
        "overview": "In 1970s London amidst the punk rock revolution, a young grifter named Estella is determined to make a name for herself with her designs. She befriends a pair of young thieves who appreciate her appetite for mischief, and together they are able to build a life for themselves on the London streets. One day, Estella’s flair for fashion catches the eye of the Baroness von Hellman, a fashion legend who is devastatingly chic and terrifyingly haute. But their relationship sets in motion a course of events and revelations that will cause Estella to embrace her wicked side and become the raucous, fashionable and revenge-bent Cruella.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/wToO8opxkGwKgSfJ1JK8tGvkG6U.jpg",
        "genres": "Comedy, Crime, Adventure",
        "unique_id": "cruella-337404",
        "release_date": "2021-05-26"
    },
    {
        "id": "438631",
        "title": "Dune",
        "overview": "Paul Atreides, a brilliant and gifted young man born into a great destiny beyond his understanding, must travel to the most dangerous planet in the universe to ensure the future of his family and his people. As malevolent forces explode into conflict over the planet's exclusive supply of the most precious resource in existence-a commodity capable of unlocking humanity's greatest potential-only those who can conquer their fear will survive.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/d5NXSklXo0qyIYkgV94XAgMIckC.jpg",
        "genres": "Science Fiction, Adventure",
        "unique_id": "dune-438631",
        "release_date": "2021-09-15"
    },
    {
        "id": "436969",
        "title": "The Suicide Squad",
        "overview": "Supervillains Harley Quinn, Bloodsport, Peacemaker and a collection of nutty cons at Belle Reve prison join the super-secret, super-shady Task Force X as they are dropped off at the remote, enemy-infused island of Corto Maltese.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/q61qEyssk2ku3okWICKArlAdhBn.jpg",
        "genres": "Action, Comedy, Adventure",
        "unique_id": "thesuicidesquad-436969",
        "release_date": "2021-07-28"
    },
    {
        "id": "423108",
        "title": "The Conjuring: The Devil Made Me Do It",
        "overview": "Paranormal investigators Ed and Lorraine Warren encounter what would become one of the most sensational cases from their files. The fight for the soul of a young boy takes them beyond anything they'd ever seen before, to mark the first time in U.S. history that a murder suspect would claim demonic possession as a defense.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/xbSuFiJbbBWCkyCCKIMfuDCA4yV.jpg",
        "genres": "Horror, Mystery, Thriller",
        "unique_id": "theconjuringthedevilmademedoit-423108",
        "release_date": "2021-05-25"
    },
    {
        "id": "846433",
        "title": "The Enforcer",
        "overview": "A noir thriller set in Miami, the film follows an enforcer who discovers his femme fatale boss has branched out into cyber sex trafficking, putting a young runaway he’s befriended at risk. He sacrifices everything to save the young girl from the deadly organization he’s spent his life building.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/72V1r1G8S87ELagVxjqAUdChMCt.jpg",
        "genres": "Action, Crime, Drama",
        "unique_id": "theenforcer-846433",
        "release_date": "2022-09-22"
    },
    {
        "id": "1017129",
        "title": "Detective Chirp & the Golden Beehive",
        "overview": "Residents of Honey Valley are getting ready for their favorite holiday - City Day, when all citizens have the opportunity to admire a unique artifact - the Golden Hive. According to legend, it was found by the founders of Honey Valley, and legend has it that thousands of misfortunes will fall upon the town if the Hive disappears. On the eve of the holiday, the Beehive is kidnapped. The squirrel Chink, Sophie's owl detective's assistant, is blamed for this. Chink and his friends have to unravel the case, find the real crook and return not only the Golden Hive, but also peace to the Valley.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/oxCPceQ4exEuxU3vfRl8doWyqj8.jpg",
        "genres": "Animation, Comedy, Mystery, Adventure, Family",
        "unique_id": "detectivechirpthegoldenbeehive-1017129",
        "release_date": "2022-11-17"
    },
    {
        "id": "315162",
        "title": "Puss in Boots: The Last Wish",
        "overview": "Puss in Boots discovers that his passion for adventure has taken its toll: He has burned through eight of his nine lives, leaving him with only one life left. Puss sets out on an epic journey to find the mythical Last Wish and restore his nine lives.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/aV1KGO9X3S4kzqEptVDAvGjccql.jpg",
        "genres": "Animation, Adventure, Fantasy, Comedy, Family",
        "unique_id": "pussinbootsthelastwish-315162",
        "release_date": "2022-12-07"
    },
    {
        "id": "414906",
        "title": "The Batman",
        "overview": "In his second year of fighting crime, Batman uncovers corruption in Gotham City that connects to his own family while facing a serial killer known as the Riddler.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/74xTEgt7R36Fpooo50r9T25onhq.jpg",
        "genres": "Crime, Mystery, Thriller",
        "unique_id": "thebatman-414906",
        "release_date": "2022-03-01"
    },
    {
        "id": "1018247",
        "title": "MK Ultra",
        "overview": "Set during the true and unconscionable Central Intelligence Agency MK ULTRA drug experimentations in the early 1960s. The journey of Ford Strauss, a brilliant psychiatrist, whose moral and scientific boundaries are pushed to the limit as he is recruited to run a subsect of the program in a rural Mississippi Mental Hospital.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/x3G3CCvLYy4EoLuhuUB9YlReFIN.jpg",
        "genres": "Thriller",
        "unique_id": "mkultra-1018247",
        "release_date": "2022-10-07"
    },
    {
        "id": "361743",
        "title": "Top Gun: Maverick",
        "overview": "After more than thirty years of service as one of the Navy’s top aviators, and dodging the advancement in rank that would ground him, Pete “Maverick” Mitchell finds himself training a detachment of TOP GUN graduates for a specialized mission the likes of which no living pilot has ever seen.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/62HCnUTziyWcpDaBO2i1DX17ljH.jpg",
        "genres": "Action, Drama",
        "unique_id": "topgunmaverick-361743",
        "release_date": "2022-05-21"
    },
    {
        "id": "987573",
        "title": "Believers",
        "overview": "On a small island somewhere near Japan, three cult members have devoted themselves to the \"Deserted Island Program\". Calling each other by rank, these people-two men and one women-have been chosen by their superiors to throw off the corrupt influence of modern society and \"purify\" themselves. But as time passes two of the members begin to give into human desire.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/sw1sFRVaUCHD0CVTXtnoEFFYyr6.jpg",
        "genres": "Drama",
        "unique_id": "believers-987573",
        "release_date": "2022-07-08"
    },
    {
        "id": "985939",
        "title": "Fall",
        "overview": "For best friends Becky and Hunter, life is all about conquering fears and pushing limits. But after they climb 2,000 feet to the top of a remote, abandoned radio tower, they find themselves stranded with no way down. Now Becky and Hunter’s expert climbing skills will be put to the ultimate test as they desperately fight to survive the elements, a lack of supplies, and vertigo-inducing heights",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/spCAxD99U1A6jsiePFoqdEcY0dG.jpg",
        "genres": "Thriller",
        "unique_id": "fall-985939",
        "release_date": "2022-08-11"
    },
    {
        "id": "718930",
        "title": "Bullet Train",
        "overview": "Unlucky assassin Ladybug is determined to do his job peacefully after one too many gigs gone off the rails. Fate, however, may have other plans, as Ladybug's latest mission puts him on a collision course with lethal adversaries from around the globe—all with connected, yet conflicting, objectives—on the world's fastest train.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/zTgMFlHG5D1EqdQDhfOTAsyzGoX.jpg",
        "genres": "Action, Comedy, Thriller",
        "unique_id": "bullettrain-718930",
        "release_date": "2022-08-03"
    },
    {
        "id": "76600",
        "title": "Avatar: The Way of Water",
        "overview": "Set more than a decade after the events of the first film, learn the story of the Sully family (Jake, Neytiri, and their kids), the trouble that follows them, the lengths they go to keep each other safe, the battles they fight to stay alive, and the tragedies they endure.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/t6HIqrRAclMCA60NsSmeqe9RmNV.jpg",
        "genres": "Science Fiction, Adventure, Action",
        "unique_id": "avatarthewayofwater-76600",
        "release_date": "2022-12-14"
    },
    {
        "id": "675353",
        "title": "Sonic the Hedgehog 2",
        "overview": "After settling in Green Hills, Sonic is eager to prove he has what it takes to be a true hero. His test comes when Dr. Robotnik returns, this time with a new partner, Knuckles, in search for an emerald that has the power to destroy civilizations. Sonic teams up with his own sidekick, Tails, and together they embark on a globe-trotting journey to find the emerald before it falls into the wrong hands.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/6DrHO1jr3qVrViUO6s6kFiAGM7.jpg",
        "genres": "Action, Adventure, Family, Comedy",
        "unique_id": "sonicthehedgehog2-675353",
        "release_date": "2022-03-30"
    },
    {
        "id": "507086",
        "title": "Jurassic World Dominion",
        "overview": "Four years after Isla Nublar was destroyed, dinosaurs now live—and hunt—alongside humans all over the world. This fragile balance will reshape the future and determine, once and for all, whether human beings are to remain the apex predators on a planet they now share with history's most fearsome creatures.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/jbAvCACjLf1ZG0unB2tdmx5HAf1.jpg",
        "genres": "Adventure, Action, Science Fiction",
        "unique_id": "jurassicworlddominion-507086",
        "release_date": "2022-06-01"
    },
    {
        "id": "453395",
        "title": "Doctor Strange in the Multiverse of Madness",
        "overview": "Doctor Strange, with the help of mystical allies both old and new, traverses the mind-bending and dangerous alternate realities of the Multiverse to confront a mysterious new adversary.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/ddJcSKbcp4rKZTmuyWaMhuwcfMz.jpg",
        "genres": "Fantasy, Action, Adventure",
        "unique_id": "doctorstrangeinthemultiverseofmadness-453395",
        "release_date": "2022-05-04"
    },
    {
        "id": "505642",
        "title": "Black Panther: Wakanda Forever",
        "overview": "Queen Ramonda, Shuri, M’Baku, Okoye and the Dora Milaje fight to protect their nation from intervening world powers in the wake of King T’Challa’s death.  As the Wakandans strive to embrace their next chapter, the heroes must band together with the help of War Dog Nakia and Everett Ross and forge a new path for the kingdom of Wakanda.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/sv1xJUazXeYqALzczSZ3O6nkH75.jpg",
        "genres": "Action, Adventure, Science Fiction",
        "unique_id": "blackpantherwakandaforever-505642",
        "release_date": "2022-11-09"
    },
    {
        "id": "502356",
        "title": "The Super Mario Bros. Movie",
        "overview": "While working underground to fix a water main, Brooklyn plumbers—and brothers—Mario and Luigi are transported down a mysterious pipe and wander into a magical new world. But when the brothers are separated, Mario embarks on an epic quest to find Luigi.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/qNBAXBIQlnOThrVvA6mA2B5ggV6.jpg",
        "genres": "Family, Comedy, Adventure, Animation",
        "unique_id": "thesupermariobrosmovie-502356",
        "release_date": "2023-04-05"
    },
    {
        "id": "603692",
        "title": "John Wick: Chapter 4",
        "overview": "With the price on his head ever increasing, John Wick uncovers a path to defeating The High Table. But before he can earn his freedom, Wick must face off against a new enemy with powerful alliances across the globe and forces that turn old friends into foes.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/vZloFAK7NmvMGKE7VkF5UHaz0I.jpg",
        "genres": "Action, Thriller, Crime",
        "unique_id": "johnwickchapter4-603692",
        "release_date": "2023-03-22"
    },
    {
        "id": "872585",
        "title": "Oppenheimer",
        "overview": "The story of J. Robert Oppenheimer's role in the development of the atomic bomb during World War II.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/8Gxv8gSFCU0XGDykEGv7zR1n2ua.jpg",
        "genres": "Drama, History",
        "unique_id": "oppenheimer-872585",
        "release_date": "2023-07-19"
    },
    {
        "id": "1165067",
        "title": "Cosmic Chaos",
        "overview": "Battles in virtual reality, survival in a post-apocalyptic wasteland, a Soviet spaceship giving a distress signal - Fantastic stories created with advanced special effects and passion.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/mClzWv7gBqgXfjZXp49Enyoex1v.jpg",
        "genres": "Thriller, Science Fiction",
        "unique_id": "cosmicchaos-1165067",
        "release_date": "2023-08-03"
    },
    {
        "id": "447365",
        "title": "Guardians of the Galaxy Vol. 3",
        "overview": "Peter Quill, still reeling from the loss of Gamora, must rally his team around him to defend the universe along with protecting one of their own. A mission that, if not completed successfully, could quite possibly lead to the end of the Guardians as we know them.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/r2J02Z2OpNTctfOSN1Ydgii51I3.jpg",
        "genres": "Science Fiction, Adventure, Action, Comedy",
        "unique_id": "guardiansofthegalaxyvol3-447365",
        "release_date": "2023-05-03"
    },
    {
        "id": "569094",
        "title": "Spider-Man: Across the Spider-Verse",
        "overview": "After reuniting with Gwen Stacy, Brooklyn’s full-time, friendly neighborhood Spider-Man is catapulted across the Multiverse, where he encounters the Spider Society, a team of Spider-People charged with protecting the Multiverse’s very existence. But when the heroes clash on how to handle a new threat, Miles finds himself pitted against the other Spiders and must set out on his own to save those he loves most.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/8Vt6mWEReuy4Of61Lnj5Xj704m8.jpg",
        "genres": "Animation, Action, Adventure, Science Fiction",
        "unique_id": "spidermanacrossthespiderverse-569094",
        "release_date": "2023-05-31"
    },
    {
        "id": "895956",
        "title": "The Burning Cold",
        "overview": "Winter of 1943. Andorra, a small country in the Pyrenees.  In the tense calm of a borderland, where echoes of a nearby war reach the ears of the local inhabitants, Antonio and Sara, a young, married couple, are expecting their first child. No one knows exactly what is going on, nor what is being fought over, the priority is just to survive another day.  When a family of Jews fleeing Nazi persecution arrives in the valley, the locals will find their lives disrupted and filled with a sense of fear and unease. Sara will have to face her own contradictions and decide whether to follow her head... or her conscience.  The past, along with all the secrets that have remained buried under the snow for so many years, are about to surface. The burning cold has reached the mountains.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/xa8pzQOxaGeqKJj9ny1W1gyngxX.jpg",
        "genres": "Drama, War",
        "unique_id": "theburningcold-895956",
        "release_date": "2023-01-20"
    },
    {
        "id": "1111867",
        "title": "In Flames",
        "overview": "After the death of the family patriarch, a mother and daughter’s precarious existence is ripped apart. They must find strength in each other if they are to survive the malevolent forces that threaten to engulf them.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/ckvYipZZ3VLz2nPuqxJ8RSRfbm8.jpg",
        "genres": "Drama, Horror",
        "unique_id": "inflames-1111867",
        "release_date": "2023-09-28"
    },
    {
        "id": "897160",
        "title": "Brave Citizen",
        "overview": "An expelled boxing champion, who now is a high-school teacher, witnesses intolerable violence and throws her first punch to build justice against it, while putting on a mask.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/6Ea5i6APeTfm4hHh6dg5Z733JVS.jpg",
        "genres": "Action, Drama, Comedy",
        "unique_id": "bravecitizen-897160",
        "release_date": "2023-10-25"
    },
    {
        "id": "1480799",
        "title": "The Great Escape",
        "overview": "No overview available",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/h7shL668vhC2wsZQSBWzxkMuZ8K.jpg",
        "genres": "Action, Thriller",
        "unique_id": "thegreatescape-1480799",
        "release_date": "2023-05-26"
    },
    {
        "id": "1195585",
        "title": "The Hard Hit",
        "overview": "An Interpol agent hunting the head of a global crime syndicate tracks his target to Las Vegas, but when the criminal organization kills his wife and daughter, he goes above the law to get his revenge.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/whkFbOZTamHeugEG95jvQehSzAH.jpg",
        "genres": "Action, Thriller, Crime",
        "unique_id": "thehardhit-1195585",
        "release_date": "2023-10-20"
    },
    {
        "id": "976573",
        "title": "Elemental",
        "overview": "In a city where fire, water, land and air residents live together, a fiery young woman and a go-with-the-flow guy will discover something elemental: how much they have in common.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/4Y1WNkd88JXmGfhtWR7dmDAo1T2.jpg",
        "genres": "Animation, Comedy, Family, Fantasy, Romance",
        "unique_id": "elemental-976573",
        "release_date": "2023-06-14"
    },
    {
        "id": "575264",
        "title": "Mission: Impossible - Dead Reckoning Part One",
        "overview": "Ethan Hunt and his IMF team embark on their most dangerous mission yet: To track down a terrifying new weapon that threatens all of humanity before it falls into the wrong hands. With control of the future and the world's fate at stake and dark forces from Ethan's past closing in, a deadly race around the globe begins. Confronted by a mysterious, all-powerful enemy, Ethan must consider that nothing can matter more than his mission—not even the lives of those he cares about most.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/NNxYkU70HPurnNCSiCjYAmacwm.jpg",
        "genres": "Action, Adventure, Thriller",
        "unique_id": "missionimpossibledeadreckoningpartone-575264",
        "release_date": "2023-07-08"
    },
    {
        "id": "1092073",
        "title": "The Haunting at Saint Joseph's",
        "overview": "An engaged Muslim doctor, her fiancé, and their friends go on a holiday at St. Joseph’s Guesthouse, unaware that it was the site of a sacrifice of an innocent centuries before. They soon come to believe that it's haunted and causing them to go crazy, as their emotions spiral out of control.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/eDzQFxs0KTzHUPkIR0c44TSGJUR.jpg",
        "genres": "Horror, Thriller",
        "unique_id": "thehauntingatsaintjosephs-1092073",
        "release_date": "2023-02-26"
    },
    {
        "id": "1180763",
        "title": "From the Shadows",
        "overview": "When Dr. Joseph Cawl and members of his Hidden Wisdom cult die in a mysterious fire, survivors contact a paranormal expert to find the truth. What they discover makes them the next target of a deranged killer.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/22aFuf6UnDaGP9G5CLfF92Cj1nf.jpg",
        "genres": "Thriller, Science Fiction, Horror",
        "unique_id": "fromtheshadows-1180763",
        "release_date": "2023-09-22"
    },
    {
        "id": "667538",
        "title": "Transformers: Rise of the Beasts",
        "overview": "When a new threat capable of destroying the entire planet emerges, Optimus Prime and the Autobots must team up with a powerful faction known as the Maximals. With the fate of humanity hanging in the balance, humans Noah and Elena will do whatever it takes to help the Transformers as they engage in the ultimate battle to save Earth.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/gPbM0MK8CP8A174rmUwGsADNYKD.jpg",
        "genres": "Science Fiction, Adventure, Action",
        "unique_id": "transformersriseofthebeasts-667538",
        "release_date": "2023-06-06"
    },
    {
        "id": "1092899",
        "title": "The Siege",
        "overview": "International assassin Walker is compromised during a mission and sent to a reassignment center for a new identity. During his stay at the facility, a ruthless assault team storms the compound searching for someone their boss has lost. Walker begrudgingly falls in with skilled hitwoman Elda and her mysterious ward Juliet in order to survive the night.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/hVh4hMzkXNLnScudbid6hDvjMPk.jpg",
        "genres": "Action, Thriller",
        "unique_id": "thesiege-1092899",
        "release_date": "2023-03-10"
    },
    {
        "id": "385687",
        "title": "Fast X",
        "overview": "Over many missions and against impossible odds, Dom Toretto and his family have outsmarted, out-nerved and outdriven every foe in their path. Now, they confront the most lethal opponent they've ever faced: A terrifying threat emerging from the shadows of the past who's fueled by blood revenge, and who is determined to shatter this family and destroy everything—and everyone—that Dom loves, forever.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/fiVW06jE7z9YnO4trhaMEdclSiC.jpg",
        "genres": "Action, Crime, Thriller, Adventure, Mystery",
        "unique_id": "fastx-385687",
        "release_date": "2023-05-17"
    },
    {
        "id": "939243",
        "title": "Sonic the Hedgehog 3",
        "overview": "Sonic, Knuckles, and Tails reunite against a powerful new adversary, Shadow, a mysterious villain with powers unlike anything they have faced before. With their abilities outmatched in every way, Team Sonic must seek out an unlikely alliance in hopes of stopping Shadow and protecting the planet.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/d8Ryb8AunYAuycVKDp5HpdWPKgC.jpg",
        "genres": "Action, Science Fiction, Comedy, Family",
        "unique_id": "sonicthehedgehog3-939243",
        "release_date": "2024-12-19"
    },
    {
        "id": "1359977",
        "title": "Conjuring the Cult",
        "overview": "After discovering his blood-soaked daughter dead in the bathtub, David Bryson attends a self-help group to help save him from his ghostly nightmares. But when a group of mysterious cult-like women offer to help him resurrect his daughter. David's choices will not just decide his fate... but the fate of his dead daughter's SOUL.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/t4MiAeYpjL7saYvqvcn9xtOfA4K.jpg",
        "genres": "Horror, Drama",
        "unique_id": "conjuringthecult-1359977",
        "release_date": "2024-10-01"
    },
    {
        "id": "933260",
        "title": "The Substance",
        "overview": "A fading celebrity decides to use a black market drug, a cell-replicating substance that temporarily creates a younger, better version of herself.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/lqoMzCcZYEFK729d6qzt349fB4o.jpg",
        "genres": "Horror, Science Fiction",
        "unique_id": "thesubstance-933260",
        "release_date": "2024-09-07"
    },
    {
        "id": "912649",
        "title": "Venom: The Last Dance",
        "overview": "Eddie and Venom are on the run. Hunted by both of their worlds and with the net closing in, the duo are forced into a devastating decision that will bring the curtains down on Venom and Eddie's last dance.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/vGXptEdgZIhPg3cGlc7e8sNPC2e.jpg",
        "genres": "Action, Science Fiction, Adventure",
        "unique_id": "venomthelastdance-912649",
        "release_date": "2024-10-22"
    },
    {
        "id": "1241982",
        "title": "Moana 2",
        "overview": "After receiving an unexpected call from her wayfinding ancestors, Moana journeys alongside Maui and a new crew to the far seas of Oceania and into dangerous, long-lost waters for an adventure unlike anything she's ever faced.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/aLVkiINlIeCkcZIzb7XHzPYgO6L.jpg",
        "genres": "Animation, Adventure, Family, Comedy",
        "unique_id": "moana2-1241982",
        "release_date": "2024-11-21"
    },
    {
        "id": "1356236",
        "title": "Saint Catherine",
        "overview": "An orphaned girl is rescued from a satanic ritual and taken to Saint Catherine Institute for homeless youth. There she will learn new skills while facing demons that stalk her.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/hBJdzKPeDaC96AzlrtMWBomYSZV.jpg",
        "genres": "Horror",
        "unique_id": "saintcatherine-1356236",
        "release_date": "2024-09-24"
    },
    {
        "id": "533535",
        "title": "Deadpool & Wolverine",
        "overview": "A listless Wade Wilson toils away in civilian life with his days as the morally flexible mercenary, Deadpool, behind him. But when his homeworld faces an existential threat, Wade must reluctantly suit-up again with an even more reluctant Wolverine.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/8cdWjvZQUExUUTzyp4t6EDMubfO.jpg",
        "genres": "Action, Comedy, Science Fiction",
        "unique_id": "deadpoolwolverine-533535",
        "release_date": "2024-07-24"
    },
    {
        "id": "823219",
        "title": "Flow",
        "overview": "A solitary cat, displaced by a great flood, finds refuge on a boat with various species and must navigate the challenges of adapting to a transformed world together.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/imKSymKBK7o73sajciEmndJoVkR.jpg",
        "genres": "Animation, Fantasy, Adventure",
        "unique_id": "flow-823219",
        "release_date": "2024-08-29"
    },
    {
        "id": "1184918",
        "title": "The Wild Robot",
        "overview": "After a shipwreck, an intelligent robot called Roz is stranded on an uninhabited island. To survive the harsh environment, Roz bonds with the island's animals and cares for an orphaned baby goose.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/9w0Vh9eizfBXrcomiaFWTIPdboo.jpg",
        "genres": "Animation, Science Fiction, Family",
        "unique_id": "thewildrobot-1184918",
        "release_date": "2024-09-12"
    },
    {
        "id": "1011985",
        "title": "Kung Fu Panda 4",
        "overview": "Po is gearing up to become the spiritual leader of his Valley of Peace, but also needs someone to take his place as Dragon Warrior. As such, he will train a new kung fu practitioner for the spot and will encounter a villain called the Chameleon who conjures villains from the past.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/nqXsAaQsKw2gKpkfhIgjXNDRqg7.jpg",
        "genres": "Animation, Family, Action, Comedy, Adventure, Fantasy",
        "unique_id": "kungfupanda4-1011985",
        "release_date": "2024-03-02"
    },
    {
        "id": "811941",
        "title": "Devara: Part 1",
        "overview": "Devara, a fearless man from a coastal region, embarks on a perilous journey into the treacherous world of the sea to safeguard the lives of his people. Unbeknownst to him, his brother Bhaira is plotting a conspiracy against him. As events unfold, Devara passes on his legacy to his mild-mannered and timid son, Varada.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/1105WNYals12Va2f4F3VeBZdcWX.jpg",
        "genres": "Action, Drama",
        "unique_id": "devarapart1-811941",
        "release_date": "2024-09-26"
    },
    {
        "id": "519182",
        "title": "Despicable Me 4",
        "overview": "Gru and Lucy and their girls—Margo, Edith and Agnes—welcome a new member to the Gru family, Gru Jr., who is intent on tormenting his dad. Gru also faces a new nemesis in Maxime Le Mal and his femme fatale girlfriend Valentina, forcing the family to go on the run.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/wWba3TaojhK7NdycRhoQpsG0FaH.jpg",
        "genres": "Animation, Family, Comedy, Science Fiction",
        "unique_id": "despicableme4-519182",
        "release_date": "2024-06-20"
    },
    {
        "id": "1260820",
        "title": "Stream",
        "overview": "Craven, a streamer with thousands of followers on a live streaming platform, has prepared a very special stream for Halloween. What no one expects when reacting to a video of Pentagram, a group of young paranormal investigators, is that the live experience will turn into the worst night of their lives. And maybe... the last.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/nnyjtBfUYA8ASHA9OhADrX0sMNQ.jpg",
        "genres": "Horror",
        "unique_id": "stream-1260820",
        "release_date": "2024-02-06"
    },
    {
        "id": "558449",
        "title": "Gladiator II",
        "overview": "Years after witnessing the death of the revered hero Maximus at the hands of his uncle, Lucius is forced to enter the Colosseum after his home is conquered by the tyrannical Emperors who now lead Rome with an iron fist. With rage in his heart and the future of the Empire at stake, Lucius must look to his past to find strength and honor to return the glory of Rome to its people.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/2cxhvwyEwRlysAmRH4iodkvo0z5.jpg",
        "genres": "Action, Adventure, Drama",
        "unique_id": "gladiatorii-558449",
        "release_date": "2024-11-13"
    },
    {
        "id": "1022789",
        "title": "Inside Out 2",
        "overview": "Teenager Riley's mind headquarters is undergoing a sudden demolition to make room for something entirely unexpected: new Emotions! Joy, Sadness, Anger, Fear and Disgust, who’ve long been running a successful operation by all accounts, aren’t sure how to feel when Anxiety shows up. And it looks like she’s not alone.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/vpnVM9B6NMmQpWeZvzLvDESb2QY.jpg",
        "genres": "Animation, Adventure, Comedy, Family",
        "unique_id": "insideout2-1022789",
        "release_date": "2024-06-11"
    },
    {
        "id": "762509",
        "title": "Mufasa: The Lion King",
        "overview": "Mufasa, a cub lost and alone, meets a sympathetic lion named Taka, the heir to a royal bloodline. The chance meeting sets in motion an expansive journey of a group of misfits searching for their destiny.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/lurEK87kukWNaHd0zYnsi3yzJrs.jpg",
        "genres": "Adventure, Family, Animation",
        "unique_id": "mufasathelionking-762509",
        "release_date": "2024-12-18"
    },
    {
        "id": "552524",
        "title": "Lilo & Stitch",
        "overview": "The wildly funny and touching story of a lonely Hawaiian girl and the fugitive alien who helps to mend her broken family.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/mKKqV23MQ0uakJS8OCE2TfV5jNS.jpg",
        "genres": "Family, Comedy, Science Fiction",
        "unique_id": "lilostitch-552524",
        "release_date": "2025-05-17"
    },
    {
        "id": "950387",
        "title": "A Minecraft Movie",
        "overview": "Four misfits find themselves struggling with ordinary problems when they are suddenly pulled through a mysterious portal into the Overworld: a bizarre, cubic wonderland that thrives on imagination. To get back home, they'll have to master this world while embarking on a magical quest with an unexpected, expert crafter, Steve.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/yFHHfHcUgGAxziP1C3lLt0q2T4s.jpg",
        "genres": "Family, Comedy, Adventure, Fantasy",
        "unique_id": "aminecraftmovie-950387",
        "release_date": "2025-03-31"
    },
    {
        "id": "447273",
        "title": "Snow White",
        "overview": "Following the benevolent King's disappearance, the Evil Queen dominated the once fair land with a cruel streak. Princess Snow White flees the castle when the Queen, in her jealousy over Snow White's inner beauty, tries to kill her. Deep into the dark woods, she stumbles upon seven magical dwarves and a young bandit named Jonathan. Together, they strive to survive the Queen's relentless pursuit and aspire to take back the kingdom.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/oLxWocqheC8XbXbxqJ3x422j9PW.jpg",
        "genres": "Family, Fantasy",
        "unique_id": "snowwhite-447273",
        "release_date": "2025-03-12"
    },
    {
        "id": "1098006",
        "title": "Fountain of Youth",
        "overview": "A treasure-hunting mastermind assembles a team for a life-changing adventure. But to outwit and outrun threats at every turn, he'll need someone even smarter than he is: his estranged sister.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/4iWjGghUj2uyHo2Hyw8NFBvsNGm.jpg",
        "genres": "Adventure, Fantasy, Mystery",
        "unique_id": "fountainofyouth-1098006",
        "release_date": "2025-05-19"
    },
    {
        "id": "1197306",
        "title": "A Working Man",
        "overview": "Levon Cade left behind a decorated military career in the black ops to live a simple life working construction. But when his boss's daughter, who is like family to him, is taken by human traffickers, his search to bring her home uncovers a world of corruption far greater than he ever could have imagined.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/6FRFIogh3zFnVWn7Z6zcYnIbRcX.jpg",
        "genres": "Action, Crime, Thriller",
        "unique_id": "aworkingman-1197306",
        "release_date": "2025-03-26"
    },
    {
        "id": "1241436",
        "title": "Warfare",
        "overview": "A platoon of Navy SEALs embarks on a dangerous mission in Ramadi, Iraq, with the chaos and brotherhood of war retold through their memories of the event.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/srj9rYrjefyWqkLc6l2xjTGeBGO.jpg",
        "genres": "War, Action",
        "unique_id": "warfare-1241436",
        "release_date": "2025-04-09"
    },
    {
        "id": "986056",
        "title": "Thunderbolts*",
        "overview": "After finding themselves ensnared in a death trap, seven disillusioned castoffs must embark on a dangerous mission that will force them to confront the darkest corners of their pasts.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/m9EtP1Yrzv6v7dMaC9mRaGhd1um.jpg",
        "genres": "Action, Science Fiction, Adventure",
        "unique_id": "thunderbolts-986056",
        "release_date": "2025-04-30"
    },
    {
        "id": "1297028",
        "title": "Rosario",
        "overview": "Wall Street stockbroker Rosario Fuentes returns to her grandmother's apartment after her sudden death. While sorting through her belongings, Rosario discovers a hidden chamber that's filled with occult artifacts tied to dark generational rituals. As supernatural occurrences begin to plague her, she must confront her family's buried secrets and face the truth about the sacrifices and choices they made.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/beLZhuHT97849WkWgty2X1hkWUa.jpg",
        "genres": "Horror",
        "unique_id": "rosario-1297028",
        "release_date": "2025-05-01"
    },
    {
        "id": "977294",
        "title": "Tin Soldier",
        "overview": "An ex-special forces operative seeks revenge against a cult leader who has corrupted his former comrades, the Shinjas. This leader, known as The Bokushi, promises veterans a purpose and protection, but is revealed to be a destructive influence. The ex-soldier, Nash Cavanaugh, joins forces with military operative Emmanuel Ashburn to infiltrate the Bokushi's fortress and expose his reign of terror",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/lFFDrFLXywFhy6khHes1LCFVMsL.jpg",
        "genres": "Action, Thriller",
        "unique_id": "tinsoldier-977294",
        "release_date": "2025-05-22"
    },
    {
        "id": "324544",
        "title": "In the Lost Lands",
        "overview": "A queen sends the powerful and feared sorceress Gray Alys to the ghostly wilderness of the Lost Lands in search of a magical power, where she and her guide, the drifter Boyce, must outwit and outfight both man and demon.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/dDlfjR7gllmr8HTeN6rfrYhTdwX.jpg",
        "genres": "Action, Fantasy, Adventure",
        "unique_id": "inthelostlands-324544",
        "release_date": "2025-02-27"
    },
    {
        "id": "1233069",
        "title": "Exterritorial",
        "overview": "When her son vanishes inside a US consulate, ex-special forces soldier Sara does everything in her power to find him — and uncovers a dark conspiracy.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/jM2uqCZNKbiyStyzXOERpMqAbdx.jpg",
        "genres": "Thriller, Action",
        "unique_id": "exterritorial-1233069",
        "release_date": "2025-04-29"
    },
    {
        "id": "1001414",
        "title": "Fear Street: Prom Queen",
        "overview": "Who will be voted queen at Shadyside High's 1988 prom? For underdog Lori, competition is cutthroat even before someone starts killing off the candidates.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/gevScWYkF8l5i9NjFSXo8HfPNyy.jpg",
        "genres": "Horror, Mystery",
        "unique_id": "fearstreetpromqueen-1001414",
        "release_date": "2025-05-23"
    },
    {
        "id": "574475",
        "title": "Final Destination Bloodlines",
        "overview": "Plagued by a violent recurring nightmare, college student Stefanie heads home to track down the one person who might be able to break the cycle and save her family from the grisly demise that inevitably awaits them all.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/6WxhEvFsauuACfv8HyoVX6mZKFj.jpg",
        "genres": "Horror, Mystery",
        "unique_id": "finaldestinationbloodlines-574475",
        "release_date": "2025-05-14"
    },
    {
        "id": "1144430",
        "title": "Last Bullet",
        "overview": "Car genius Lino returns to conclude his vendetta against Areski and the corrupt commander who ruined their lives in this turbo-charged trilogy finale.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/qycPITRqXgPai7zj1gKffjCdSB5.jpg",
        "genres": "Action, Crime, Thriller, Drama",
        "unique_id": "lastbullet-1144430",
        "release_date": "2025-05-06"
    },
    {
        "id": "896536",
        "title": "The Legend of Ochi",
        "overview": "In a remote village on the island of Carpathia, a shy farm girl named Yuri is raised to fear an elusive animal species known as ochi. But when Yuri discovers a wounded baby ochi has been left behind, she escapes on a quest to bring him home.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/wVujUVvY4qvKARAslItQ4ARKqtz.jpg",
        "genres": "Family, Fantasy, Adventure",
        "unique_id": "thelegendofochi-896536",
        "release_date": "2025-04-18"
    },
    {
        "id": "668489",
        "title": "Havoc",
        "overview": "When a drug heist swerves lethally out of control, a jaded cop fights his way through a corrupt city's criminal underworld to save a politician's son.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/ubP2OsF3GlfqYPvXyLw9d78djGX.jpg",
        "genres": "Action, Crime, Thriller",
        "unique_id": "havoc-668489",
        "release_date": "2025-04-25"
    },
    {
        "id": "822119",
        "title": "Captain America: Brave New World",
        "overview": "After meeting with newly elected U.S. President Thaddeus Ross, Sam finds himself in the middle of an international incident. He must discover the reason behind a nefarious global plot before the true mastermind has the entire world seeing red.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/pzIddUEMWhWzfvLI3TwxUG2wGoi.jpg",
        "genres": "Action, Thriller, Science Fiction",
        "unique_id": "captainamericabravenewworld-822119",
        "release_date": "2025-02-12"
    },
    {
        "id": "1232546",
        "title": "Until Dawn",
        "overview": "One year after her sister Melanie mysteriously disappeared, Clover and her friends head into the remote valley where she vanished in search of answers. Exploring an abandoned visitor center, they find themselves stalked by a masked killer and horrifically murdered one by one...only to wake up and find themselves back at the beginning of the same evening.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/juA4IWO52Fecx8lhAsxmDgy3M3.jpg",
        "genres": "Horror, Mystery",
        "unique_id": "untildawn-1232546",
        "release_date": "2025-04-23"
    },
    {
        "id": "575265",
        "title": "Mission: Impossible - The Final Reckoning",
        "overview": "Ethan Hunt and team continue their search for the terrifying AI known as the Entity — which has infiltrated intelligence networks all over the globe — with the world's governments and a mysterious ghost from Hunt's past on their trail. Joined by new allies and armed with the means to shut the Entity down for good, Hunt is in a race against time to prevent the world as we know it from changing forever.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/z53D72EAOxGRqdr7KXXWp9dJiDe.jpg",
        "genres": "Action, Adventure, Thriller",
        "unique_id": "missionimpossiblethefinalreckoning-575265",
        "release_date": "2025-05-17"
    },
    {
        "id": "1011477",
        "title": "Karate Kid: Legends",
        "overview": "After a family tragedy, kung fu prodigy Li Fong is uprooted from his home in Beijing and forced to move to New York City with his mother. When a new friend needs his help, Li enters a karate competition – but his skills alone aren't enough. Li's kung fu teacher Mr. Han enlists original Karate Kid Daniel LaRusso for help, and Li learns a new way to fight, merging their two styles into one for the ultimate martial arts showdown.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/iXbNjhz2KU64vq6NEVVG5pIxggy.jpg",
        "genres": "Action, Adventure, Drama",
        "unique_id": "karatekidlegends-1011477",
        "release_date": "2025-05-08"
    },
    {
        "id": "1355983",
        "title": "Espantaho",
        "overview": "As a family clashes over their late father's land, an eerie painting appears and releases something sinister during the nine-day funeral ritual.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/itRDwuQxbtmgaxyrHI4rGiIrxxX.jpg",
        "genres": "Horror",
        "unique_id": "espantaho-1355983",
        "release_date": "2025-02-07"
    },
    {
        "id": "1061474",
        "title": "Superman",
        "overview": "Superman, a cub reporter in Metropolis, embarks on a journey to reconcile his Kryptonian heritage with his human upbringing as Clark Kent.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/9dRUAOU1HyxnyLmCcMMD9FMzGj.jpg",
        "genres": "Action, Adventure, Science Fiction",
        "unique_id": "superman-1061474",
        "release_date": "2025-07-09"
    },
    {
        "id": "64635",
        "title": "Total Recall",
        "overview": "Factory worker Doug Quaid takes a virtual mind-trip vacation with the Rekall company, opting for implanted memories of being a spy. When the procedure goes wrong, Quaid becomes a wanted man by the police and joins forces with a rebel fighter to stop the evil Chancellor Cohaagen.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/fucmGeZYM4yzqJUnDTc4pKQNCej.jpg",
        "genres": "Action, Science Fiction, Thriller",
        "unique_id": "totalrecall-64635",
        "release_date": "2012-08-02"
    },
    {
        "id": "527216",
        "title": "So Connected",
        "overview": "It is about a guy who thinks he already knows someone just because he's been watching her life through photos and videos.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/6qIxCS77jZyMgvWhn6tqkT157Zn.jpg",
        "genres": "Romance",
        "unique_id": "soconnected-527216",
        "release_date": "2018-05-23"
    },
    {
        "id": "1381548",
        "title": "My Future You",
        "overview": "Karen and Lex meet on a dating app, only to discover they're living fifteen years apart, connected by a comet. As they unravel the mystery of their unique situation, they work together to change the past and alter their fates.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/qXzKWdQchfcAWqZahH3BM6DvT6t.jpg",
        "genres": "Romance, Comedy, Fantasy, Drama",
        "unique_id": "myfutureyou-1381548",
        "release_date": "2024-12-25",
        "player": [
            "https:\/\/movieseut.top\/#bqf1f"
        ]
    },
    {
        "id": "911430",
        "title": "F1",
        "overview": "Racing legend Sonny Hayes is coaxed out of retirement to lead a struggling Formula 1 team—and mentor a young hotshot driver—while chasing one more chance at glory.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/vqBmyAj0Xm9LnS1xe1MSlMAJyHq.jpg",
        "genres": "Action, Drama",
        "unique_id": "f1-911430",
        "release_date": "2025-06-25"
    },
    {
        "id": "404114",
        "title": "Mobile Suit Gundam Thunderbolt: December Sky",
        "overview": "During the One Year War of U.C. 0079, the Earth Federation and Principality of Zeon engage in a fierce battle at the \"Thunderbolt Sector\", a shoal zone in the former Colony Side 4 \"Moore\". After successfully infiltrating Zeon's sniper field, ace Federation pilot and jazz enthusiast Io Fleming is given control of the latest Gundam prototype.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/9lkEs98koT3et0Csyb996apllOm.jpg",
        "genres": "Action, Animation, Drama, Science Fiction, War",
        "unique_id": "mobilesuitgundamthunderboltdecembersky-404114",
        "release_date": "2016-06-25"
    },
    {
        "id": "38762",
        "title": "Meat Grinder",
        "overview": "A poverty stricken woman starts a restaurant where she slaughters people and serves up human flesh, cut from her victims.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/bpmVJeTEJdBkWoSvX7wvk8ch5MH.jpg",
        "genres": "Horror, Thriller",
        "unique_id": "meatgrinder-38762",
        "release_date": "2009-03-18"
    },
    {
        "id": "16911",
        "title": "The Inhabited Island",
        "overview": "On the threshold of 22nd century, furrowing the space, protagonist from the Free Search Group makes emergency landing on an unknown planet where he must stay. People who are living on this planet have remained at the stone level of the 20th century, with its social problems, miserable ecology and shaky world..",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/7tVc6BEY7FEowyEDOTqzfpqBnDo.jpg",
        "genres": "Science Fiction, Adventure",
        "unique_id": "theinhabitedisland-16911",
        "release_date": "2008-12-18"
    },
    {
        "id": "174675",
        "title": "The Machine",
        "overview": "Already deep into a second Cold War, Britain’s Ministry of Defense seeks a game-changing weapon. Programmer Vincent McCarthy unwittingly provides an answer in The Machine, a super-strong human cyborg. When a programming bug causes the prototype to decimate his lab, McCarthy takes his obsessive efforts underground, far away from inquisitive eyes.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/nNHAZaTrFVOjwLhkMYm4syUjNw8.jpg",
        "genres": "Science Fiction, Thriller",
        "unique_id": "themachine-174675",
        "release_date": "2013-04-25"
    },
    {
        "id": "755898",
        "title": "War of the Worlds",
        "overview": "Will Radford is a top cyber-security analyst for Homeland Security who tracks potential threats to national security through a mass surveillance program, until one day an attack by an unknown entity leads him to question whether the government is hiding something from him... and from the rest of the world.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/tlqTdabozTVjWEPWUhDRITxKt6R.jpg",
        "genres": "Science Fiction, Thriller",
        "unique_id": "waroftheworlds-755898",
        "release_date": "2025-07-29"
    },
    {
        "id": "1311031",
        "title": "Demon Slayer: Kimetsu no Yaiba Infinity Castle",
        "overview": "As the Demon Slayer Corps members and Hashira engaged in a group strength training program, the Hashira Training, in preparation for the forthcoming battle against the demons, Muzan Kibutsuji appears at the Ubuyashiki Mansion. With the head of the Demon Corps in danger, Tanjiro and the Hashira rush to the headquarters but are plunged into a deep descent to a mysterious space by the hands of Muzan Kibutsuji.  The destination of where Tanjiro and Demon Slayer Corps have fallen is the demons' stronghold – the Infinity Castle. And so, the battleground is set as the final battle between the Demon Slayer Corps and the demons ignites.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/aFRDH3P7TX61FVGpaLhKr6QiOC1.jpg",
        "genres": "Animation, Action, Fantasy, Thriller",
        "unique_id": "demonslayerkimetsunoyaibainfinitycastle-1311031",
        "release_date": "2025-07-18"
    },
    {
        "id": "1087192",
        "title": "How to Train Your Dragon",
        "overview": "On the rugged isle of Berk, where Vikings and dragons have been bitter enemies for generations, Hiccup stands apart, defying centuries of tradition when he befriends Toothless, a feared Night Fury dragon. Their unlikely bond reveals the true nature of dragons, challenging the very foundations of Viking society.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/53dsJ3oEnBhTBVMigWJ9tkA5bzJ.jpg",
        "genres": "Fantasy, Family, Action",
        "unique_id": "howtotrainyourdragon-1087192",
        "release_date": "2025-06-06"
    },
    {
        "id": "1071585",
        "title": "M3GAN 2.0",
        "overview": "After the underlying tech for M3GAN is stolen and misused by a powerful defense contractor to create a military-grade weapon known as Amelia, M3GAN's creator Gemma realizes that the only option is to resurrect M3GAN and give her a few upgrades, making her faster, stronger, and more lethal.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/oekamLQrwlJjRNmfaBE4llIvkir.jpg",
        "genres": "Action, Science Fiction, Thriller",
        "unique_id": "m3gan20-1071585",
        "release_date": "2025-06-25"
    },
    {
        "id": "617126",
        "title": "The Fantastic 4: First Steps",
        "overview": "Against the vibrant backdrop of a 1960s-inspired, retro-futuristic world, Marvel's First Family is forced to balance their roles as heroes with the strength of their family bond, while defending Earth from a ravenous space god called Galactus and his enigmatic Herald, Silver Surfer.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/x26MtUlwtWD26d0G0FXcppxCJio.jpg",
        "genres": "Science Fiction, Adventure",
        "unique_id": "thefantastic4firststeps-617126",
        "release_date": "2025-07-23"
    },
    {
        "id": "980477",
        "title": "Ne Zha 2",
        "overview": "After a catastrophic event leaves their bodies destroyed, Ne Zha and Ao Bing are granted a fragile second chance at life. As tensions rise between the dragon clans and celestial forces, the two must undergo a series of perilous trials that will test their bond, challenge their identities, and decide the fate of both mortals and immortals.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/293Mo4GWf7Tl0TfAr5NFghqeMy7.jpg",
        "genres": "Animation, Fantasy, Adventure, Action",
        "unique_id": "nezha2-980477",
        "release_date": "2025-01-29"
    },
    {
        "id": "1234821",
        "title": "Jurassic World Rebirth",
        "overview": "Five years after the events of Jurassic World Dominion, covert operations expert Zora Bennett is contracted to lead a skilled team on a top-secret mission to secure genetic material from the world's three most massive dinosaurs. When Zora's operation intersects with a civilian family whose boating expedition was capsized, they all find themselves stranded on an island where they come face-to-face with a sinister, shocking discovery that's been hidden from the world for decades.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/1RICxzeoNCAO5NpcRMIgg1XT6fm.jpg",
        "genres": "Science Fiction, Adventure, Action",
        "unique_id": "jurassicworldrebirth-1234821",
        "release_date": "2025-07-01"
    },
    {
        "id": "986206",
        "title": "Night Carnage",
        "overview": "A blogger who is also a werewolf meets a dashing playboy with a dark secret of his own. Starring Logan Andrews and Christian Howard.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/w0wjPQKhlqisSbylf1sWZiNyc2h.jpg",
        "genres": "Action, Horror, Romance",
        "unique_id": "nightcarnage-986206",
        "release_date": "2025-07-29"
    },
    {
        "id": "576784",
        "title": "Upon the Magic Roads",
        "overview": "Romantic John the Fool and his friend Foal set out on a series of unpredictable adventures in different magical worlds. The two buddies will have to outsmart an evil tyrant king, catch the firebird, and find John’s true love.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/kY4tmwZaBZitnDRcWFp3Wy197Um.jpg",
        "genres": "Adventure, Fantasy",
        "unique_id": "uponthemagicroads-576784",
        "release_date": "2021-02-18"
    },
    {
        "id": "1185528",
        "title": "Legends of the Condor Heroes: The Gallants",
        "overview": "Under Genghis Khan, the Mongolian army pushes west to destroy the Jin Dynasty, setting its sights on the Song Dynasty next. Amid internal conflicts among martial arts schools, Guo Jing unites the Central Plains' warriors to defend Xiangyang, embodying courage and loyalty in the fight for the nation.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/fUCFEGFlMIFet9ja72JDAeG1he8.jpg",
        "genres": "Action, Drama, History",
        "unique_id": "legendsofthecondorheroesthegallants-1185528",
        "release_date": "2025-01-29"
    },
    {
        "id": "1155281",
        "title": "Creation of the Gods II: Demon Force",
        "overview": "Taishi Wen Zhong led the army of Shang Dynasty including Deng Chanyu and four generals of the Mo Family to Xiqi. With the help of Kunlun immortals such as Jiang Ziya, Ji Fa led the army and civilians of Xiqi to defend their homeland.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/dfUCs5HNtGu4fofh83uiE2Qcy3v.jpg",
        "genres": "Action, Fantasy, War",
        "unique_id": "creationofthegodsiidemonforce-1155281",
        "release_date": "2025-01-29"
    },
    {
        "id": "1225572",
        "title": "Screamboat",
        "overview": "A late-night boat ride turns into a desperate fight for survival in New York City when a mischievous mouse becomes a monstrous reality.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/78xGAhQaKpgq9TI08XK40Ua2bGx.jpg",
        "genres": "Horror, Comedy",
        "unique_id": "screamboat-1225572",
        "release_date": "2025-03-20"
    },
    {
        "id": "1226406",
        "title": "Love Hurts",
        "overview": "A realtor is pulled back into the life he left behind after his former partner-in-crime resurfaces with an ominous message. With his crime-lord brother also on his trail, he must confront his past and the history he never fully buried.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/skPPVeHoTTVVSJlb0Ib5vrqiuA4.jpg",
        "genres": "Action, Comedy, Romance",
        "unique_id": "lovehurts-1226406",
        "release_date": "2025-02-06"
    },
    {
        "id": "615453",
        "title": "Ne Zha",
        "overview": "A young boy is born as the reincarnation of a demonic power, into a society that hates and fears him. Destined by prophecy to bring destruction to the world, Nezha must choose between good and evil to see if he can change his fate.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/phM9bb6s9c60LA8qwsdk7U1N2cS.jpg",
        "genres": "Animation, Fantasy, Adventure",
        "unique_id": "nezha-615453",
        "release_date": "2019-07-26"
    },
    {
        "id": "1322985",
        "title": "Nezha: Demon Child is Back",
        "overview": "The Dragon King and the Four Seas Dragon King flood Chentang Pass to force Li Jing to hand over Ne Zha. After Ne Zha kills himself and his mortal body dies, Tai Yi wants to build a temple to help him be rebirthed. Taoist Ran Deng presents Li Jing with the exquisite pagoda, saying that if Ne Zha accepts the incense without merit, he will be attacked by the devil's heart. Li Jing cannot bear to let Ne Zha go astray and decides to destroy the temple to make Ne Zha misunderstand, while Li's mother and Tai Yi secretly enshrine Ne Zha's tablet.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/7V29MDzEIEzLbO98pI45YOy4DUM.jpg",
        "genres": "Action, Fantasy",
        "unique_id": "nezhademonchildisback-1322985",
        "release_date": "2024-07-30"
    },
    {
        "id": "1173900",
        "title": "I Am Nezha 2",
        "overview": "No overview available",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/vHf7HD3DU7Zz5ZiW5NfxagFHmfg.jpg",
        "genres": "Animation, Fantasy, Drama",
        "unique_id": "iamnezha2-1173900",
        "release_date": "2023-09-29"
    },
    {
        "id": "663558",
        "title": "New Gods: Nezha Reborn",
        "overview": "While living as an ordinary deliveryman and motor racing fan, Nezha encounters old nemeses and must rediscover his powers to protect his loved ones.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/np4ScPY04HESKBbpexwstKsipKe.jpg",
        "genres": "Animation, Fantasy, Action",
        "unique_id": "newgodsnezhareborn-663558",
        "release_date": "2021-02-06"
    },
    {
        "id": "504093",
        "title": "The Legend of Nezha",
        "overview": "Nezha gets into trouble and implicates his parents who are punished by the heavens along with him. He bravely steps up and admits his fault, which touches the heavens, and his effort comes to fruition. The family of three finally reunites in the end.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/4SCKVllTzSo3iDmD8MDjK72QH4s.jpg",
        "genres": "Fantasy, Adventure",
        "unique_id": "thelegendofnezha-504093",
        "release_date": ""
    },
    {
        "id": "628202",
        "title": "Nezha Conquers the Dragon King",
        "overview": "Yin Shiniang finally gives birth after an unusual pregnancy lasting three years and eight months. Suddenly, Shi Ji the snake spirit appears, declaring that she has come for revenge for the harm she once suffered at the hand of Yin's husband, Li Jing. Mother and son are rescued by the powerful deity Taiyi Zhenren, who promises to teach the son, Nezha, the path of immortality once he comes of age. Eighteen years later, Nezha sets off to take up his discipleship, but things do not go as planned. Nezha slays a flood dragon to rescue a young woman, Ling Zhu, once again incurring the wrath of Shi Ji, who vows to kill Nezha and avenge the dragon. In the ensuing chaos, Nezha takes his own life rather than risking harm to innocent civilians in Chen Tang Pass. Taiyi Zhenren arrives and tells Lingzhu that there is a way to bring Nezha back-but it involves paying the ultimate price.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/hNf8rQoICiK0ujDhnBWStrXbsc1.jpg",
        "genres": "Action, Comedy, Fantasy",
        "unique_id": "nezhaconquersthedragonking-628202",
        "release_date": "2019-05-14"
    },
    {
        "id": "474139",
        "title": "I Am Nezha",
        "overview": "No overview available",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/b0BKVqQ25YenrJQkwGiscrmFQah.jpg",
        "genres": "Animation, Fantasy, Family",
        "unique_id": "iamnezha-474139",
        "release_date": "2016-10-01"
    },
    {
        "id": "1007734",
        "title": "Nobody 2",
        "overview": "Former assassin Hutch Mansell takes his family on a nostalgic vacation to a small-town theme park, only to be pulled back into violence when they clash with a corrupt operator, a crooked sheriff, and a ruthless crime boss.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/svXVRoRSu6zzFtCzkRsjZS7Lqpd.jpg",
        "genres": "Action, Thriller",
        "unique_id": "nobody2-1007734",
        "release_date": "2025-08-13"
    },
    {
        "id": "1241470",
        "title": "Osiris",
        "overview": "Special Forces commandos on a mission are abducted mid-operation by a mysterious spacecraft. Upon waking aboard, they find themselves prey to a relentless alien race in a fight for survival.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/3YtZHtXPNG5AleisgEatEfZOT2w.jpg",
        "genres": "Science Fiction, Action, Horror",
        "unique_id": "osiris-1241470",
        "release_date": "2025-07-25"
    },
    {
        "id": "13494",
        "title": "Red Sonja",
        "overview": "A young girl rises from the ashes of tragedy to become the most feared warrior woman of all time: the She-Devil with a Sword.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/l10eghFN1nQmWwMSt91MlLvZZFA.jpg",
        "genres": "Adventure, Action, Fantasy",
        "unique_id": "redsonja-13494",
        "release_date": "2025-07-31"
    },
    {
        "id": "1022787",
        "title": "Elio",
        "overview": "Elio, a space fanatic with an active imagination, finds himself on a cosmic misadventure where he must form new bonds with eccentric alien lifeforms, navigate a crisis of intergalactic proportions and somehow discover who he is truly meant to be.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/w2ARwtc1zoh0pyfwmyhpZHwuXgK.jpg",
        "genres": "Animation, Family, Comedy, Adventure, Science Fiction",
        "unique_id": "elio-1022787",
        "release_date": "2025-06-18"
    },
    {
        "id": "1389158",
        "title": "Maa",
        "overview": "A mother and daughter encounter a demon in a village where girls have been disappearing.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/kc5n7LJUmvBsVxzAla1ONN8kouP.jpg",
        "genres": "Horror",
        "unique_id": "maa-1389158",
        "release_date": "2025-06-20"
    },
    {
        "id": "1175942",
        "title": "The Bad Guys 2",
        "overview": "The now-reformed Bad Guys are trying (very, very hard) to be good, but instead find themselves hijacked into a high-stakes, globe-trotting heist, masterminded by a new team of criminals they never saw coming: The Bad Girls.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/5DJbIWxIotQYUnRrRGhSxjxmvye.jpg",
        "genres": "Animation, Family, Comedy, Crime, Adventure",
        "unique_id": "thebadguys2-1175942",
        "release_date": "2025-07-24"
    },
    {
        "id": "1078605",
        "title": "Weapons",
        "overview": "When all but one child from the same class mysteriously vanish on the same night at exactly the same time, a community is left questioning who or what is behind their disappearance.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/cpf7vsRZ0MYRQcnLWteD5jK9ymT.jpg",
        "genres": "Horror, Mystery",
        "unique_id": "weapons-1078605",
        "release_date": "2025-08-04"
    },
    {
        "id": "791155",
        "title": "Secret Headquarters",
        "overview": "While hanging out after school, Charlie and his friends discover the headquarters of the world’s most powerful superhero hidden beneath his home. When villains attack, they must team up to defend the headquarters and save the world.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/3ce0zzOZ7DhkPxYNsPZmoQU2piH.jpg",
        "genres": "Action, Adventure, Comedy, Science Fiction, Family",
        "unique_id": "secretheadquarters-791155",
        "release_date": "2022-08-12"
    },
    {
        "id": "23047",
        "title": "Season of the Witch",
        "overview": "A 14th century Crusader returns with his comrade to a homeland devastated by the Black Plague. The Church commands the two knights to transport a witch to a remote abbey, where monks will perform a ritual in hopes of ending the pestilence.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/dNVqi8EsBtnnwfR6TgiWM51JOuS.jpg",
        "genres": "Adventure, Fantasy, Action",
        "unique_id": "seasonofthewitch-23047",
        "release_date": "2011-01-07",
        "player": [
            "https:\/\/vidsrc.cc\/v2\/embed\/movie\/23047?autoPlay=false"
        ]
    },
    {
        "id": "254526",
        "title": "The Midnight After",
        "overview": "On a night just like any other, a minibus full of passengers drives through a tunnel and arrives in another dimension; the eclectic group of passengers seek refuge in a deserted cafe and make a horrific discovery.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/dk7FyOT3g294P4BUJ09P4XGJ98D.jpg",
        "genres": "Comedy, Mystery, Science Fiction, Thriller, Horror",
        "unique_id": "themidnightafter-254526",
        "release_date": "2014-04-10"
    },
    {
        "id": "987400",
        "title": "Aztec Batman: Clash of Empires",
        "overview": "In the time of the Aztec empire, tragedy strikes Yohualli Coatl when his father is murdered by Spanish conquistadors. To warn King Moctezuma and his high priest, Yoka, of imminent danger, Yohualli escapes to Tenochtitlán. There, he trains in the temple of the bat god Tzinacan with his mentor, developing equipment and weaponry to confront the Spanish invasion and avenge his father’s death. Along the way, he encounters key figures like the fierce Jaguar Woman and the conquistador Hernán Cortés.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/s0Mlo5w4INp3bUdsJo3RaSSMXWz.jpg",
        "genres": "Animation, Action, Adventure, Fantasy",
        "unique_id": "aztecbatmanclashofempires-987400",
        "release_date": "2025-09-18"
    },
    {
        "id": "1038392",
        "title": "The Conjuring: Last Rites",
        "overview": "Paranormal investigators Ed and Lorraine Warren take on one last terrifying case involving mysterious entities they must confront.",
        "poster": "https:\/\/image.tmdb.org\/t\/p\/w500\/7JzOmJ1fIU43I3gLHYsY8UzNzjG.jpg",
        "genres": "Horror",
        "unique_id": "theconjuringlastrites-1038392",
        "release_date": "2025-09-03"
    }
]